#version: 0.2
Ġ ì
Ġ Ġ
Ġ ë
ì Ŀ
í ķ
ë ĭ
Ġ ê
ĠĠ ĠĠ
Ġ t
ì Ĺ
i n
ìĿ ´
Ġ a
ë Ĭ
e r
ê ³
ëĭ ¤
o n
ëĬ Ķ
ê °
Ġ í
h e
r e
ì Ħ
ì §
a t
ìĹ Ĳ
íķ ĺ
ì ł
ì ŀ
ì ļ
ê³ ł
ìĿ Ħ
ë ¡
e n
o r
Ġì ŀ
Ġ s
ì ĭ
Ġt he
ë ı
ì ķ
ê ¸
Ġ c
ë¡ ľ
ë ¦
e s
ê° Ģ
ê ²
ì§ Ģ
i t
Ġì Ŀ
ìĿ ĺ
a l
i s
ì ĸ
íķ ľ
ë ¥
a n
ìĦ ľ
ì ľ
Ī ëĭ¤
ë §
ë ĵ
Ġ w
o u
a r
ë Ĥ
i on
ìĿ Ģ
ëı Ħ
Ġ f
l e
ĠĠ Ġ
Ġì ķ
ì Ĭ
Ġì ł
Ġ p
ê¸ °
in g
Ĥ ¬
Ġê °
ìĸ ´
Ġ o
ĠĠĠĠ ĠĠĠĠ
ë¦ ¬
e d
Ġ b
Ġë §
n d
ìļ Ķ
ë¥ ¼
i c
ë ©
íķ ´
Ġë °
ê µ
a s
Ġ m
ë Ŀ
Ġ in
Ī ĺ
Ġ d
ë ł
r o
e t
Į Ģ
ëĿ ¼
· ¸
ìľ ¼
Ġt o
ë į
c t
Ġo f
ìĭ ľ
³ ´
ĠìĿ ´
Ġì Ĺ
Ġê ²
ëĭ Īëĭ¤
ì Ľ
ë °
ë ¬
Ġì ĭ
ë ¶
Ġa nd
ë ŀ
ê² Į
Ġë Ĥ
£ ¼
ìĿ ¸
en t
ì ĥ
ì ĺ
ìķ Ħ
e l
s t
ëĤ ĺ
Ġìŀ Ī
ëĵ ¤
Ġt h
ìĬ ¤
Ġì §
Ġë ĭ
Ġ h
ë© ´
Ċ Ċ
o m
Ġê ³
ë Ł
ìŀ Ĳ
Ġì ĺ
Ġ n
Ġ re
i l
a m
ìľ¼ ë¡ľ
ì Ĥ¬
Ġì Ħ
ì ²
Ġì Ĥ¬
Ġ íķĺ
i g
í ĸ
i d
Ġê ·¸
ë§ Į
Ġ l
Ġ e
ì ¹
i m
ë ²
a c
Ġ (
ê³ ¼
Ġì Īĺ
í Ļ
Ġ \
at ion
Ġì ĥ
ĠĠĠĠ ĠĠĠ
Ġê ¸
ìŀ ¥
Ġë ª
Ġë ¶
o t
ì £¼
Ġ $
ìĹĲ ìĦľ
Ġê° Ģ
Ġìķ Ħ
ì Ļ
ê ±
o l
ë ĮĢ
ìł ķ
í ĺ
ì Ĩ
ëĭ Ī
s e
Ġ =
ë ª
Ġ is
ë ³´
ìĽ Ĳ
ëį °
Ġë ĵ
v e
ìĿ ¼
* *
Ġ íķ
êµ ¬
u r
u t
¹ Ħ
Ġ T
Ġ g
í Ĭ
í ĥ
ë¶ Ģ
ë Ĳ
ìĥ ģ
ì Īĺ
ì °
ë ħ
Ġì ĸ
Ġ S
Ġì ľ
o d
a d
Ġê² ĥ
u l
ĉ ĉ
i f
Ġf or
ìł ľ
c e
Ġ I
Ġë ³´
ë ³
o w
ìĬ µ
v er
ê ¹
Ġ y
Ġê µ
0 0
Ġë ı
Ġ <
ìł ģ
a g
Ġë ĮĢ
íĬ ¸
Ġë ¬
ìļ ©
t r
a y
ë ¯
¡ °
Ġê¸ °
Ġëĭ ¤
Ġ C
¤ ĳ
Ġ u
Ġ íķľ
a b
ìĦ ±
ou r
ëĵ ľ
ìł Ħ
) ;
ìĹ ¬
Ġì ļ
l y
Ġìĭ ľ
Ġ A
Ġb e
ëı Ļ
Ġ on
â Ģ
t h
ĠëĤ ĺ
Ġì§ Ģ
q u
Ġ {
it h
- -
Ġì °
ìĻ Ģ
c h
ê ·¸
= "
Ġì Ĩ
p e
Ġ "
ì Ĥ
Ġë Ĳ
at e
ë¬ ¸
t er
ëŁ ¬
Ġì ¢
u m
´ Ģ
ìĬµ ëĭĪëĭ¤
íķĺ ëĬĶ
e m
ë Ħ
ê° Ħ
í Ķ
Ġìŀ Ĳ
ìķ ¼
Ġê ±
Ġìł Ħ
Ġ '
í Į
íĻ Ķ
č Ċ
ë¬ ´
ìĭ ł
Ġ v
ë £
ìļ °
ìĦ ¸
ê± °
ì¹ ĺ
ê¹ Į
Ġìł ķ
Ġth at
Ġc on
Ġí Ļ
ì§ Ħ
a p
h t
Ġì £¼
íķĺ ê³ł
/ /
Ġìł ľ
< /
Ġs t
í Ħ
ë§ Ī
ë ¹Ħ
ëł ¤
ë¶ Ħ
ìŀ ħ
ìĨ Į
2 0
e x
es t
i r
Ġw ith
ì ¶
ķ Į
u n
ìĿ Į
ct ion
ĠĠĠĠĠĠĠĠ ĠĠĠ
êµ Ń
Ġ *
ìĺ ¤
es s
o c
í ļ
en d
íĦ °
ìĹ Ī
Ġp ro
Ġ M
í ŀ
Ġëª ¨
as s
Ġí ĺ
Ġa s
i v
ëŀ ĺ
íķ ł
Ġë ³
Ġ P
p t
ëĬĶ ëį°
Ġa l
Ġë į
í ģ
ë© °
í ı
Ġìĸ ´
Ġa n
Ġë¶ Ģ
í Ĩ
ìĤ °
_ {
ã ħ
re s
ëĲ ĺ
Ġë Ħ
Ġì ²
ĠìĿ ¼
Ġë§ Ī
er s
. .
Ġìĺ ¤
Ġ íķ´
ìĹ ħ
Ġ it
u s
íŀ Ī
e w
ĠìĹ Ĩ
ëħ Ħ
ë¯ ¸
ìĭ Ŀ
ê¸ Ī
ì ¦
ĠëĤ ´
Ġw h
ĠìĿ ¸
Ġìķ Ĭ
Ġì ¶
Ġë ²
Ġ B
ìĭ ¤
Ġ }
am e
Ġìĥ ģ
Ġì¢ ĭ
an d
ìļ ´
Ľ Ħ
íĸ ī
Ġì Ļ
p l
Ġe x
ĳ Ĳ
Ġìľ Ħ
Ġa re
ëĤ ´
a in
Ġì ¹
Ġìĥ Ŀ
Ġy ou
ë¬ ¼
Ġí ĸ
ì§Ģ ë§Į
at h
is t
or t
Ġ or
íļ Į
Ġì ¤ĳ
Ġë° Ķ
u b
ê ·
ë¥ ´
ê³ µ
ê³ Ħ
ê° ľ
Ġê³ ł
Ġìķ Ī
Ġì Ĥ
ì ¡°
Ġì Ĭ
k e
ag e
ëª ħ
u e
ĠìŀĪ ëĬĶ
Ġc om
Ġê² ½
Ġ -
ìķ Ī
o re
Ġ :
ou t
ê² ½
Ġ F
Ġ D
í Ĵ
ĠìĨ Į
Ġ r
o s
Ġd e
Ġë ¨
ë Ķ
o p
il l
ìľ ł
er e
ĠëĲ ĺ
ĠìĹ ¬
Ġë§ Į
Ġth is
Ġc l
ìĥ Ŀ
Ġìŀ Īëĭ¤
ëį ĺ
ì ħ
Ġê³ µ
m ent
ì° ¨
it y
Ġë ¯
r i
in e
ëĭ ¨
Ġí ı
e ct
ìĿ´ ëĭ¤
ê° ģ
ig ht
Ġw e
Ġë§ İ
Ġë ķĮ
Ġëĵ ±
Ġê° Ļ
Ġë Ķ
ìľ Ħ
íķ Ļ
Ġí Į
Ġ R
Ġ W
Ġ L
ìĸ´ ìļĶ
" >
ar t
! !
ìĦ ł
Ġì Ľ
u re
ro m
© ëĭĪëĭ¤
í İ
Ġë§ Ĳ
Ġ H
Ġ &
ì² ´
ê ´Ģ
ëį Ķ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġë ¹Ħ
íĥ Ģ
íķĺ ê²Į
1 0
n t
Ġì ¡°
ëĦ ¤
p er
ĠT he
ëŀ Į
e g
{ \
ĠĠĠĠ Ġ
Ġìľ ł
Ġêµ ¬
ì Ī
Ġí Ķ
ìĿ´ ëĿ¼
ë° ©
i z
ab le
ì ¤ĳ
ìł Ģ
ìĹ °
ëĭ ¹
íĴ Ī
( )
ìŀ Ī
Ġ E
Ġa t
an t
íģ ¬
Ġ N
ex t
ur n
í ħ
ì ¤
ë§ ¤
êµ Ĳ
ëĵ¤ ìĿ´
Ġí ĥ
ê± ´
âĢ Ļ
ìŀħ ëĭĪëĭ¤
Ġìĭ ł
Ġëĵ ¤
ë² Ī
ìŀ ¬
ì ¡
ìĸ ĳ
Ġ G
i al
i ve
Ġb y
o g
ìķ ĺ
Ġë¬ ´
Ġëį Ķ
ëł ¥
ac k
Ġí Ĩ
c l
ìĽ Ķ
a ve
ìĺ ģ
Ġìļ °
íĺ ¸
al l
Ġt r
ëĭ ĺ
íĸ Ī
ul t
i es
Ġs e
l d
20 1
ìĭ ¬
Ġ$ \
ëª ¨
p ort
ĠìĹ °
íĸ Īëĭ¤
Ġë¶ Ħ
ĠìĬ ¤
ëĲ ľ
Ġê ´Ģ
Ġ if
ìł Ĳ
ê »
Ġê± °
i b
d e
re f
g e
Ġëı Ħ
ëł Ī
Ġë¨ ¹
ê² ł
ìĹ Īëĭ¤
Ġf rom
í Ĺ
Ġê ¹
c on
ìŀ ĳ
Ġë¯ ¸
ĠìĦ ł
Ġc an
a v
ìĹ Ń
it e
ëŀ ĳ
ê¹Į ì§Ģ
Ġë° ©
** *
a ct
ë¥ ¸
Ġìł Ģ
ì ¢
s p
Ġs h
Ġë Ĭ
ĳ ľ
or m
µ ľ
Ġn ot
ë£ Į
Ġc h
ëŁ °
y pe
½ Ķ
u st
Ġì§ Ħ
Ġìĺ Ī
t urn
ì² ľ
ëĬ ¥
in d
Ġ O
í ĭ
Ġìķ Į
an s
ĠìĿ ĺ
-- --
f f
ĠìĦ ¸
m ath
Ġë ħ
ĺ Ĳ
= =
Ġë Ĩ
g et
c om
í Ĥ
Ġ he
ìĹĲ ê²Į
Ġë ©
ë§ Ĳ
in t
r ou
Ġê ·
ë©´ ìĦľ
Ġëı Ļ
ë£ ¨
Ġí ģ
od e
ë ĳĲ
ë² ķ
ìĺ Ģ
Ġh ave
Ġcl ass
Ġë° ľ
Ġìĺ ģ
as e
i le
ëĶ Ķ
íķ´ ìĦľ
Ġìŀ ħ
ĠìĦ ľ
) ,
a re
Ġy our
ë ¨
Ġìŀ ĺ
Ġ /
ê² ĥ
ë¦¬ ê³ł
Ġë ¹
ë ¸
ë¡ Ŀ
ìĹĲ ëĬĶ
íĶ Ħ
ë¯ ¼
Ġê° ľ
ëĵ ł
1 9
ĠìĤ¬ ëŀĮ
i p
ë° Ķ
Ġu s
ì Ķ
Ġ le
´ Ī
ac e
el l
ê² ©
ì² ĺ
íĨ µ
ìļ ¸
o o
ëĤ ľ
ë° ľ
ì§ ĳ
ê° Ĳ
íĮ Į
ëĭ¤ ê³ł
ìŀ Ħ
ê» ĺ
ë² Ħ
íķĺ ìĹ¬
ìĨ į
p ro
m a
ë° ĺ
id e
ëł ĩ
im e
Ġs u
p h
pt ion
íĶ ¼
ĠíĨ µ
ar d
o st
ic e
ĠìĦ ±
ì² Ń
ë ¹
Ġí Ĭ
íı ¬
ì§ ģ
í ĽĦ
ĠìĥĿ ê°ģ
ig n
Ġë¬ ¸
ëĭ¤ ëĬĶ
Ġìŀ ¥
ì £
ì§ Ī
ë¦ Ħ
ë ĥ
Ġíķ ł
Ġw ill
it ion
Ġë§ ¤
ë³ ¸
ĠëĶ °
ì ¸
} \
at a
Ġìĭ ¤
ì¹ ´
) .
Ġí ĽĦ
Ġal l
Ġë Ī
ë¦ °
Ġw as
f t
ë ģ
a k
Ġë° Ľ
st r
ì¶ ľ
íĺ ķ
i re
ìĽ Į
at ed
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
Ġcom p
Ġ [
Â ·
ìĸ´ ìĦľ
as t
Ġí İ
} $
¶ Į
ìłģ ìĿ¸
u d
Ġê³ Ħ
ĠìĽ Ĳ
t o
Ġì ¤
Ġ j
^ {
or k
Ġì µľ
í Ŀ
ì ¼
Ġí ļ
j ect
Ġì° ¨
Ġê° Ĳ
I n
ë ´
ĠëĤ ¨
Ġë§ Ľ
Ġë¬ ¼
ìĦ¸ ìļĶ
1 2
Ġ +
T he
Ġë¶ Ī
ĠëĦ Ī
ou ld
ë¶Ģ íĦ°
Ġ Ċ
ê° ķ
ëĬ ĺ
ê· ¼
ìĦ Ŀ
Ġë ĺĲ
ì¤ Ģ
or d
c c
ãħ ł
en s
Ġ k
Ġì Ī
Ġê° ķ
Ġ im
al ue
Ġì¶ Ķ
Ġì ¦
an g
Ġ //
Ġ U
ic h
ar y
Ġë° °
un ction
t ext
ic al
Ġa b
ìķ ½
l i
Ġì ±
Ġìŀ ĳ
f orm
Ġa d
íķĺ ê¸°
Ġê± ´
Ġìŀ ¬
Ġíı ¬
Ġë° ĺ
p s
Ġre turn
íĨ ł
Ġre s
Ġêµ Ń
ë ĸ
ëĦ¤ ìļĶ
ìłģ ìľ¼ë¡ľ
b er
íķ ¨
Ġëª »
ĠT h
í ĳľ
an ce
ì¢ ħ
ë ķĮ
Ġê² °
ìĦ ¤
Ġêµ Ĳ
2 00
on e
íķľ ëĭ¤
- >
íĹ ĺ
Ġp l
íĭ °
Ġë ĳĲ
ê¸ ī
en ce
Ġìĺ ¬
íĺ Ħ
ĠìķĦ ëĭĪ
Ģ ìĿ´
Ī ¬
íķ ©ëĭĪëĭ¤
ëĿ¼ ê³ł
ì »
ë³ µ
s er
ëĵ ±
^ ^
Ġìł ģ
on g
Ġ #
Ġí Ŀ
l ic
ĉĉ ĉĉ
Ġn ew
ì¦ Ī
Ġëħ ¸
ë¦ ¼
ĠìĤ ´
ìĪ ł
ã ģ
ac h
Ġìļ Ķ
íĥ ľ
ì ±
he n
ation s
f r
Ġë° ı
ĠíĻ ķ
Ġ .
íĤ ¤
Ġíĺ Ħ
Ġd o
Ġëĭ ¨
Ġa p
ëłĩ ê²Į
Ġh as
d u
tr ing
1 1
´ ĳ
ëĭ ¬
Ġ J
ĠìŀĪ ìĬµëĭĪëĭ¤
ĠìĤ¬ ìļ©
om e
ìł ¸
ë° °
} }
ì¦ Ŀ
Ġíķ ¨
ĠíĶ ¼
Ġn e
: :
ëĤ ł
íħ Į
Ġë ģ
ëĤ ¨
ì£ ł
ëĵ¤ ìĿĢ
c al
ro w
Ġ en
Ġëĵ¤ ìĸ´
f er
ìĺ Ī
ì ½Ķ
ê ¶Į
3 0
ëĭ µ
Ġìļ° ë¦¬
ar am
Ġì »
p le
ĠI n
ëŀ Ģ
Ġ @
C on
( \
ëŁ ī
Ġíķĺ ëĬĶ
Ġ< /
ĠìĦ ¤
th er
ĠëĬ Ĳ
ĠëķĮ ë¬¸
our ce
Ġëĭ ¹
s o
Ġì° ¸
Ġíķĺ ëĤĺ
ê² °
o b
ëŁ ¼
t a
oc k
ê¸ ¸
ìł Ī
Ġ âĢ
e qu
Ġ K
Ġëĵ ľ
Ġd is
iz e
Ġm e
Ġ V
Ġì§ ĳ
res s
ent s
eg in
ì¡ ±
s et
Ġíķ Ħ
Ġcon t
íĥ Ŀ
Ġ out
Ġëĭ ¬
.. /
ëĦ Ī
Ġwh ich
Ġê²ĥ ìĿ´
il d
ĠëĦĪ ë¬´
l l
el f
1 5
oo k
b egin
ou s
ìľ ¡
ub lic
êµ °
a ke
ã Ģ
íİ ĺ
ĠíĬ ¹
Ġë§İ ìĿ´
" ,
Ġìĭ ¶
f ig
íķ ©
Ġa r
íİ ¸
ul l
Ġê²½ ìļ°
ĠëĮĢ íķľ
ëª ©
Ġg et
Ġê³ ¼
S t
ĠíĮ Į
a il
Ġ qu
ì¶ Ķ
êµ¬ ìļĶ
' ,
ëĭ ´
Ġu n
c ri
Ġíĸ Ī
Ġu p
ë¦ ½
íķĺ ì§Ģ
Ġp r
Ġs o
ë Ĩ
ê¸° ë¥¼
Ġg o
ë¡ ł
ĠìķĦ ìĿ´
ĠíĻ Ķ
ëħ ¸
Ġon e
Ġb ut
ìĺ ¨
' s
Ġíķĺ ê³ł
or y
m l
e ar
ìĻ ¸
Ġ our
íĸ ¥
ëł ¨
ìĿ´ ëĤĺ
u al
Ġì¶ ľ
ë³ Ħ
) $
ë¥ ĺ
Ġê° Ħ
íĮ Ĳ
ìĥ ī
íķ Ń
ë° ķ
re e
Ġ â
g h
( "
Ġíķ Ļ
p ut
_{ \
ĠìĹ ´
ver y
ow n
ë³´ ëĭ¤
Ġf unction
( );
t e
ëĵ¤ ìĿĺ
ë¦¬ ëĬĶ
} ,
ë¸ Į
00 0
Ġí Ĺ
** **
in k
ab el
· ¨
ì§Ģ ëĬĶ
íĻ ĺ
ĠìĹ Ń
e f
Ġë ¸
e p
c k
Ġm ore
Ġíĸ ī
Ġí ŀ
Ġì§ ģ
Ġp er
ī ´
ar k
Ġìĸ ĳ
ou nd
et h
ëĵ¤ ìĿĦ
d iv
ì ´Ī
ìĹĲ ëıĦ
or s
u p
Ġíķ¨ ê»ĺ
ìĨ ¡
Ġíķľ ëĭ¤
ëįĶ ëĿ¼
ess age
Ġë ĸ
er v
Ġs p
ª ½
Ġe v
Ġë§ ŀ
i a
íı ī
Ġíİ ¸
ìľ¼ ë©´
el y
ĠëĲ ľ
Ġê³ ³
y st
ion s
ìħ ĺ
ìĸ µ
Ġs et
} {
r ight
ĠëĤ ł
ou nt
Ġì¹ ´
Ġê°Ģ ëĬ¥
Ġìĥ Ī
en er
1 6
---- ----
~ ~
Ġìĸ´ ëĸ
ë Ī
ĠíĶ Ħ
Ġë Ŀ
ĠìĨ Ĳ
i ew
r a
Ġê¹ Ģ
l ow
el d
Ġì¢ĭ ìķĦ
Ġë³ ¸
ëĿ ½
Ġìł Ĳ
Ġë§Į ëĵ¤
Ġíļ Į
pe ct
r ay
Ġì¹ ĺ
Ġìļ ´
Ġì° ¾
c re
ê¸° ëıĦ
l ine
Ġthe ir
Ġo b
Ġin ter
5 0
Ġìĭľ ê°Ħ
o ve
Ġt ime
: //
o se
er r
ëĮĢ ë¡ľ
ol d
ìĭľ ëĬĶ
ê² ¨
Ġê°Ļ ìĿĢ
ë³ Ģ
ĵ °
Ġëı Į
ë§ Ŀ
Ġde f
íķĺ ë©´
Ġp art
Ġí Ĵ
Ġ* /
ĠìĤ °
ìĹ Ĩ
Ġíı ī
Ġin t
1 8
ver s
ot h
íķĺ ëĭ¤
íĶ Į
e q
Ġan y
Ķ ëĭ¤
t p
Ġw ork
i eld
Ġì¢ĭ ìĿĢ
Ġv ar
Ġíģ ¬
c he
ìĭľ ê°Ħ
> </
Ġê± ¸
1 00
íĿ ¬
Ġ Y
ë© Ķ
Ġë ¦
fr ac
pe c
ĠìĹ Ĳ
ĠìĻ ¸
Ġì ´Ī
.. .
ëħ Ģ
Ġëª ©
E x
Ġal so
od el
E R
sp an
e c
Ġthe y
Ġm an
v el
le ct
r y
ĠëĪ Ī
Ġíĥ Ģ
Ġë ´
s um
Ġ !
yst em
1 4
l o
Ġê² Į
Ġì² ĺ
íĻ ©
ëĬ Ĳ
ĠìĿ Į
ic k
ìľ¼ ë©°
ìĶ ¨
Ġë³ Ģ
Ġìĭľ ìŀĳ
Ġì ½Ķ
a u
íĻ ľ
ì ģ
ëĭĪ ê¹Į
ing s
ĠëķĮë¬¸ ìĹĲ
> <
ëĲĺ ìĸ´
íĮ ħ
Ġëĭ¤ ë¥¸
w e
t y
Ġs tr
ìĬ ¹
. "
Ġn ame
Ġë§İ ìĿĢ
ĠìľĦ íķ´
o int
ìħ ¨
ir st
ê¸° ê°Ģ
Ġìķ ŀ
ì ½
Ġìķ ½
Ġìĭ Ŀ
Ġìĭ ¬
ĠìĤ¬ ì§Ħ
Ġm y
ĠìĨ į
ë¨ ¸
Ġp ublic
T h
ê¸° ìĹĲ
1 3
ê ´ĳ
Ġp re
ĉĉ ĉ
) )
Ġì¢ ħ
ì§Ģ ê³ł
le d
ĠëĶ° ëĿ¼
ëĿ¼ ëĬĶ
c ite
ë¸ Ķ
ìħ Ķ
t ain
ì ª½
ì§ ľ
i x
Ġê¸ Ī
ìł ĳ
l abel
ìĿ´ëĿ¼ ê³ł
Ġì ´
ĠìĻ Ħ
ë¶ Ī
ë¨ ¹
t he
ë¦¬ ë¥¼
ìŀĪ ëĬĶ
Ġl i
ĠĠĠĠĠĠĠĠ Ġ
ê¸ Ģ
Ġì¤ Ģ
en c
ĠëĿ ¼
( '
ëĲĺ ëĬĶ
ãħ ĭ
Ġ |
Ġw hen
Ġì¹ ľ
ĠW e
o id
ëıĦ ë¡Ŀ
at es
ĠíĻ ľ
ìķĦ ìļĶ
ap p
Ġíķ ©ëĭĪëĭ¤
ë§ ī
Ġo ver
Ġë© Ķ
ì ´
Ġìłķ ë§Ĳ
ìĹ Ķ
s h
ìĺĢ ëĭ¤
ĠíķĦ ìļĶ
ìĤ ´
== ==
Ġc ol
ë° ±
Ġë§Ī ìĿĮ
Ġíĺ ¸
n e
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ig h
i e
th is
../ ../
Ġad d
Ġë¦ ¬
in al
n ame
Ġëª ħ
Ġab out
ĠëĨ Ĵ
ê° Ļ
ì¹ ¨
et a
į ¼
Ġd es
Ġê ¼
o ver
a x
Ġo ther
P ro
ëł ¹
ìĿ´ ëĬĶ
ìĬ¤ íĬ¸
Ġìĸ ¼
O N
ìĹĲìĦľ ëĬĶ
Ġth ere
ìķĺ ëĭ¤
o v
nd er
o ol
2 5
!! !
Ġì² Ń
Ġ i
I N
ëŀ ľ
ĠìŀĪ ìĹĪ
Ġë Ĵ
Ġìłķ ëıĦ
er m
ì²ĺ ëŁ¼
ĠTh is
ëł ¸
Ġ _
Ġì² ´
re at
p on
ìĸ ¸
ì¸ µ
Ġíŀ ĺ
math b
Ġì¦ Ŀ
ì ³
Ġë°Ķ ë¡ľ
r ap
c ess
Ġê°Ģ ìŀ¥
um ber
Ġë ¡
ìĿ¸ ëį°
p r
le ft
tr ib
Ġ ro
ĠëĪ Ħ
an ge
at or
1 7
N ame
Ġê· ¼
Ġí ĳľ
ĠìŀĲ ìĭł
Ġê° ģ
Ġê·¸ ëŁ°
ay s
ê³ ³
ëı ħ
ë³ ĳ
ë¦¬ ê°Ģ
ì± ħ
ke y
Ġs ome
ì¶ ķ
ëŁ ½
ic t
w o
Ġv alue
í Ī¬
Ġëį °
Ġë² Ħ
Ġë Ń
ĠìĿ´ ìĥģ
Ġu se
ëĵ Ŀ
ìĿ´ ê³ł
r m
ĠëĦ ĺ
â ĸ
Ġd ata
ĠI t
Ġt ype
ht ml
ĠíĮ Ĳ
s s
ë ī´
ic s
ìķĦ ìĦľ
ê¹ Ģ
ì¡ Į
ê± ¸
Ġê²ĥ ìĿ´ëĭ¤
$ .
$ ,
ĠëĬĲ ëĤ
íķĺ ë©°
*** -
, \
p aram
Ġne ed
trib ut
ì° ©
at ch
Ġí Ī¬
ĠìĹ Ħ
o f
ĠìĪ ľ
ì§ ¸
le ment
ê±° ëĤĺ
Ġìĸ ¸
eth od
ë§ Ľ
ì° ½
u ct
i ent
Ġë² Ī
u g
T ype
r am
Ġ )
ë¦ ´
Ġt e
ëĭµ ëĭĪëĭ¤
ìķ ħ
Ġì ī
Ġíķľ êµŃ
ĠëĶ Ķ
ê¸ ´
ĠS t
Ġì¤ Ħ
Ġh ref
Ġì¢ Ģ
ê·¸ ëŀĺ
l es
Ġëĭ ´
s ource
ìķ ł
Ġth an
Ġì§Ħ íĸī
p os
ìĪ ľ
m b
4 0
ĠíĨµ íķ´
ìĽ Ģ
ĠìĹĨ ëĬĶ
} )
Ġa cc
Ġëĭ¤ ìĭľ
ìĺ ¬
Ġê¸ ¸
ê°Ģ ëĬĶ
if ic
ãħł ãħł
Ġë ł
ëĥ ¥
Ġê·¸ ë¦¬ê³ł
l ation
ì¹ ľ
ul ar
ĠC h
rou nd
Ġre qu
ê¸° ëĬĶ
is e
Ġbe en
m essage
Ġê²ĥ ìĿĦ
im port
ter n
ìĿ´ íĬ¸
Ġa g
Ġon ly
equ ation
tr ans
Ġres ult
is h
Ġìĺ ¨
Ġì± ħ
Ġit s
} .
Ġê²ĥ ìĿĢ
ĠíĻ ĺ
Ġpro v
math cal
ìĭľ ë©´
ê° Ī
Ġì ĵ°
ìĥ Ī
R E
Ġë³ ¼
Ġëª¨ ìĬµ
Ġf e
ĠìĿ´ ìļ©
ëĵ ¯
ì° °
Ġì» ¤
Ġn o
Ġd if
c ol
re turn
S T
íķ´ ìķ¼
ar g
į ¨
Ġìłľ íĴĪ
Ġthe m
Ġë¬¸ ìłľ
S tring
at er
d d
Ġk n
rou p
ëįĶëĿ¼ êµ¬ìļĶ
ĠìķĦ ëĭ
Ġwh o
Ġëģ Ŀ
ë¶ ģ
ë° Ľ
Ġcom m
v ent
al se
y s
ê·¸ ë¦¬ê³ł
â Ķ
al ly
¾ ¸
o x
de f
Ġíģ °
Ġb u
Ġëª¨ ëĳĲ
ìĿ´ ìĹĲ
en g
Ġë° ķ
ur re
I d
t d
Ġ ,
v ar
at ic
n ing
Ġê² Ģ
ëĭ¤ ê°Ģ
i o
Ġin to
2 4
Ġl ine
i ed
ac he
Ġy ear
ic es
Ġí ħ
ľ ´
ìķ ¡
ëĬĶëį° ìļĶ
Ġ >
ìĿ´ ì§Ģ
Â· Â·
ì¸ ł
Ġfor m
Ġê²ĥ ìľ¼ë¡ľ
c ode
Ġì± Ħ
ĠìŀĪ ìĸ´
ê°Ģ ì§Ģ
ëłĪ ìĿ´
ì» ¤
20 2
ĠíĨ ł
c o
Ġp os
Ġë¹ ł
Ġre g
Ġb l
Ġ= >
Ġm ay
Ġìŀ Ħ
½ ĥ
ë² ł
ĠëĴ ¤
Ġíĺ ķ
ëĥ Ĳ
im es
į ëĭĪëĭ¤
Ġì £
ĠìŀĪ ìĿĦ
ë ĳ
on t
r it
an c
ìŀĲ ê°Ģ
d er
ìĹ ´
} (
Ġb et
Ġf irst
ì ī
Ġì ¡
il ity
Ġê·¸ ëŁ¬
ib le
Ġs ub
i ous
ìĺ¤ ëĬĺ
Ġì ·¨
al s
Ġt wo
ĠëĲ ł
id th
cri pt
A T
f ter
pl ic
? ?
Ġof f
ĠìĤ¬ ëŀĳ
cl ud
b le
ĠìķĬ ëĬĶ
ê² ¬
Ġíĸ ¥
u es
Ġì¶ ©
c ent
Ġs elf
is s
i an
Ġë³ µ
Ġli ke
_ _
s ub
n g
ì³ Ĳ
ìľ¼ ëĭĪ
Ġì º
a w
Ġw ould
Ġ el
ĠìĿ´ ëłĩê²Į
ã Ĥ
ëĭ¤ ë©´
at ive
} ^
Ġ `
at ing
ì± Ħ
Ġëª¨ ëĵł
čĊ čĊ
Ġìķ ł
Ġì° į
Ġtr ans
ìľ ¨
Ġp h
am b
ph a
ë´ ī
ìĻ Ķ
ê° Ŀ
# #
ëģ ¼
Ġcon st
Ġë¸ Ķ
le t
f o
Ġë² ķ
Ġ end
ëĤĺ ëĬĶ
/ >
Ģ ë¡ľ
íģ ¼
íķ´ ì£¼
Ġw ere
Ġwh ere
Ġê·¸ ëŀĺ
re ad
rap h
~ \
C om
Ġê° Ī
ì ¿
ì¡ ´
ë¡ľ ê·¸
ĠìĿ´ ëŁ°
ĠíĻķ ìĿ¸
ìĿ µ
ìĤ¬ ë¥¼
Ġh ow
Ġthe n
ĠëĬĲëĤ Į
} _
ad e
Ġë³´ ê³ł
Ġíļ ¨
íĬ ¹
on s
ì µľ
Ġ id
ĠëĦ £
Ġh is
íļ į
d a
Ġìŀ ¡
Ġ x
R es
T o
ht tp
it s
âĢ ¦
2 2
ìĭľ ê³ł
u res
Ġì§Ģ ê¸Ī
Ġë¡ ľ
ì§Ģ ë¥¼
a ult
Ġëł Ī
Ġb ack
âĢ Ŀ
W e
ĠìĤ ¼
ĠëĦ ¤
t ype
ce ption
h at
Ġíĸ Īëĭ¤
id er
ĠìķĦëĭĪ ëĿ¼
Ġwh at
er t
ð Ł
Ġëĭ¤ ìĸĳ
Ġp e
Ġin st
Ġì¤Ģ ë¹Ħ
Ġs im
ol low
al pha
ĠìĹ ħ
Ġs pec
Ġc re
y n
Ġthe se
ë ĺĲ
ĠìĹ¬ ëŁ¬
Ġsu p
v al
Ġì¦ Ĳ
Ġìļ ©
t ing
ë³ ¼
Ġsu ch
ad d
Ġj ust
ë§Į ìĽĲ
Ġìł Ī
cl ass
ìĿ´ëĿ¼ ëĬĶ
íķĻ êµĲ
rou gh
Ġì² ľ
it ies
as h
Ġì§ Ī
er y
Ġu nder
ar ch
Ġë ¿
Ġê· Ģ
ê· ¹
ĠìľĦ íķľ
ĠëĤ´ ê°Ģ
o y
" />
ĠëĤĺ ìĺ¤
urre nt
Ġìł ĳ
Ġì§Ģ ëĤľ
b l
Ġì¡° ê¸Ī
e ad
L E
Ġl oc
íķĺ ë©´ìĦľ
íĺ ¼
Ġdif fer
¶ ģ
Ġpro du
í į¼
ìĿ´ ìĹĪ
Ġë² ł
ëĵ¤ ìĹĲê²Į
Ġm ake
Ġo p
Ġê ´ĳ
ì¦ ĺ
au se
Ġê°Ļ ìĿ´
íķĺ ìĦ¸ìļĶ
ĠìŀĪ ìĸ´ìĦľ
Ġre l
Ġs erv
ĠìŀĪ ê³ł
n er
Ġv al
ĠìĿ´ ìķ¼
O R
Ġë°© ë²ķ
Ġìĺ¤ ëĬĺ
Ġcon s
Ġa m
Ġ= =
6 0
ìĦ ¼
n ot
Ġíĥ ľ
ê ¼
íķĺ ì§Ģë§Į
Ġa ct
íĺ Ģ
Ġëĭ¤ ìĿĮ
p end
ë ľ
Ġus ed
Ġë ĳ
ol ut
Ġë¶Ģ ë¶Ħ
ë§ ģ
Ġë ľ
Ġh igh
Ġin d
ĠëĲĺ ìĸ´
ëħ Ĳ
ption s
b ar
2 3
l p
Ġë¨ ¸
L ist
A R
ì° ¬
f ore
ìŀĲ ëĬĶ
â ĳ
el ta
ment s
Ġ err
Ġre m
Ġíķ Ń
a ir
íĻ ķ
trans lation
ê· ľ
ìĿ´ ê°Ģ
Ġn ull
res ent
Ġì° ½
ag es
ê²ł ìĬµëĭĪëĭ¤
Ġìŀ ł
ì² ł
Ġc ase
as ed
ì¤ Ħ
Ġw ell
ë¹ ł
Ġs m
ì¼ Ģ
Ġsh ould
Ġm ost
Ġsh ow
am es
2 1
ou n
ìļ ±
u de
Ġm odel
ëĪ Ħ
Ġf ollow
íı °
amb da
Ġ ent
) \
Ġë§ ī
Ġg ener
Ġëı ħ
ë° ¥
f ul
s elf
Ġì¤ĳ ìļĶ
ĠìŀĪ ìĸ´ìļĶ
C h
ë¡ Ģ
Ġh ad
Ġë° ±
Ġse e
Ġë§Įëĵ¤ ìĸ´
Ġëª ¸
Ġë§Ľ ìŀĪ
in ed
Ġe ach
Ġth rough
Ġë³ Ħ
ĠìĤ¬ ìĭ¤
form ation
Ġë¯ ¼
Ġc o
ĠëĤ ľ
ë¹Ħ ìĬ¤
êµ ´
Ġê°Ģ ê²©
it em
¨ ìĸ´
ìĸ ¼
ëł¤ ê³ł
Ġt est
ĠìĻ Ģ
â ĺ
ìŀ¥ ìĿĦ
Ġë¸ Į
ĠâĢ ľ
Ġc or
ĠI f
y le
íķ Ħ
) :
ì¼ ľ
Ġë° Ŀ
iv ate
Ġv oid
Ġê´Ģ ëł¨
ì Ł
ĠìķĬ ê³ł
íĮ ¨
ë¡ľ ìļ´
ì° ¸
as k
Ġs ystem
Ġ ~
Ġe ff
m in
E N
ìĦ± ìĿĦ
ë³´ ê³ł
ire ct
Ġe very
Ġíķ ©
h o
ot s
3 2
ĠíĹ Ī
ìĨ Ĳ
at ure
I D
ĠëĲĺ ëĬĶ
$ \
l oc
Ġí Ĥ
p re
ow er
íķ ĳ
Ġì´ Ŀ
Ġor g
Ġs c
íģ ´
ĠìĿ´ ìľł
eng th
Ġ --
ĠìĦľ ìļ¸
Ġì¹ľ êµ¬
an k
ê³ ¡
Ġd et
ëĵ¤ ëıĦ
Ġtr ue
' t
b ack
Ġì°¾ ìķĦ
u le
t on
ìĿ ĳ
m s
ĠëĤ´ ìļ©
Ġê¸ Ģ
Ĳ ëĭ¤
Ġëª¨ ë¥´
C l
ĠëĮĢ íķ´
ĠëıĮ ìķĦ
op le
con d
:// ***
um ent
ction s
am ple
íĥ Ħ
u nd
Ġê· ľ
Ġn umber
Ġìķ ¼
ëĲ ł
Ġus ing
A L
ëĵ¤ ê³¼
Ġì ½
ìķĦ ìĿ´
ì£¼ ëĬĶ
ìŀĲ ìĿĺ
ĳ ¸
ĠëĤĺ íĥĢ
ou gh
Ġì²ĺ ìĿĮ
ìĦ± ìĿ´
am ma
p ar
ì ·¨
Ġí ĭ
Ġìĸ´ëĸ ¤
Ġkn ow
ìłķ ìĿĦ
ë¦ Ń
r r
ìĿ¸ ìĿ´
ëĿ¼ ìĿ´
Ġst art
íĥ ģ
it le
t s
Ġíķľ ë²Ī
per ty
ìĶ ©
il y
ê¸° ë¡ľ
ë¦¬ ìĬ¤
Ġl ook
Ġex per
ìĤ ¼
Ġe m
ĠìķĦëĭ Į
Ġst ud
Ġa c
Ġì£ ½
Ġíģ ´
ĊĊ Ċ
iz ed
ĠP ro
ëı Į
Ġb r
he ck
ê³ ¨
Ġg iv
he d
ìĹ ¼
S S
v iew
ìķ Į
ol og
_ \
ìĥģ ìĿĦ
» ê²Į
Ġìŀħ ëĭĪëĭ¤
ìĹĨ ìĿ´
Ġíķĺ ì§Ģë§Į
Ġg r
Ġe qu
m u
ëĲľ ëĭ¤
= \
ãħ İ
ìĹĪ ìĬµëĭĪëĭ¤
) );
ì§Ģ ëıĦ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġs a
ĠíĮ ¨
ìŁ ģ
ì º
ëĲĺ ê³ł
ëĤ ¬
; ;
2 8
Ġíħ Į
Ġ\ \
íħ Ķ
Ġìłķ ë³´
Ġhe lp
ìŀ¥ ìĿ´
Ġf l
Ġel se
ĠëĨ Ģ
ì§ ķ
f or
Ġê¼ Ń
b ject
ëģ Ķ
ìĬ¤ íĥĢ
i er
Ġf alse
ì į¨
od y
2 7
y p
I t
ĠìĹ° êµ¬
ĠìĦł íĥĿ
ëł¥ ìĿĦ
ĠíĬ ¸
A r
Ġê° ĸ
ser t
"> <
p i
ëŀ ¨
ëħ ķ
Ġìĥģ íĻ©
in ce
-------- --------
ìĤ¬ ì§Ħ
Ġf ind
Ġí Ľ
Ġm in
str ing
mathb b
Ġëĸ ł
Ġin v
Ġl ist
Ġì§Ģ ìĹŃ
Ġì¶Ķ ì²ľ
19 9
ì¢ ĭ
ìģ ĺ
ĠìŀĪ ìĹĪëĭ¤
Ġh er
we en
T r
ìĹ Ħ
íķ´ ìļĶ
Ġ very
ë² Ķ
Ġëĭ¤ìĸĳ íķľ
p ress
Ġw ant
ig ma
íĸĪ ëįĺ
ìłķ ëıĦ
b e
Ġ X
â Ĺ
Ġre ad
ì§ Ŀ
Ġa ut
w h
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠìłĦ ë¬¸
Ġê ´
ĠìĿ´ ë²Ī
Ġê³ ¨
ĠëŃ Ĳ
b r
ation al
ĠëĤĺ ëĬĶ
Ġpe ople
íħ ľ
} ^{
Ġì Ķ
Ġre c
ê² Ģ
ë´ Ĳ
w n
ĠìĻ ľ
} _{
ëĨ ĵ
ì¶ ©
âĶ Ģ
ë² Į
u ch
íĥ ķ
Ġr ight
Ġs tring
d ata
ä ¸
ĠíĤ ¤
s c
Ġp oint
ëŀľ ëĵľ
**** ****
Ġë© ´
2 6
ëŀ įëĭĪëĭ¤
ìĹĲìĦľ ëıĦ
Ġdiffer ent
ë° Ģ
ëł Į
an y
ë¦¬ ìĹĲ
Ġê°Ļ ìķĦìļĶ
Ġë³´ ìĹ¬
ê·¸ ëŁ¬
aram et
ar get
// //
ĠëĬ ĺ
Ġê·¸ ëĥ¥
8 0
ë¶Ģ ë¶Ħ
w ard
Ġë ĥ
p art
ìļ° ë¦¬
ë¥ ł
ĠìĿ ½
ĠìĿ Ģ
íĻĶ ë¥¼
ìĹĪ ëĬĶëį°
w ork
ĠY ou
Ġëª ĩ
d ay
ë³´ ëĭĪ
ĠìĹĨ ëĭ¤
Ġë¯¸ êµŃ
Ġê²° ê³¼
le an
ĠìĦ¤ ëªħ
Ġì§Ģ ìĽĲ
et s
eg a
ĠâĢ ĵ
ìĿ¸ ì§Ģ
º ¼
Ġm ethod
- \
ìĹ ĩ
D ata
V alue
ĠêµĲ ìľ¡
am p
Ġch ar
Ġw or
Ġ Q
ĩ ¼
¼ ìłĢ
ĠC om
ìĭ Ń
íĬ ¼
I T
ãħ ľ
ĠìĤ¬ íļĮ
A N
Ġl ong
re am
ĠF or
Ġman y
ë² ½
ìĭĿ ìĿĦ
ĠìĿ´ ë¯¸
Ġí Ħ
Ġm od
ĠëĲľ ëĭ¤
y m
Ġst ate
ĠëĲ ©ëĭĪëĭ¤
Ġa fter
ĠìĤ¬ ìĿ´
ê²ł ëĭ¤
Ġn ow
Ġì§Ħ ì§ľ
ĠìĦ¸ ê³Ħ
Ġh and
ìłľ ê°Ģ
ĠëĺĲ ëĬĶ
Ġbe c
C T
Ġêµ¬ ë§¤
ver t
Ġbet ween
ëĶ ©
ĠìľĦ ì¹ĺ
" );
n ew
ìĸ´ ëĤĺ
ust om
íĤ ¨
ë ¿
se ction
2 9
Ġ ^^
ìķ Ķ
Ġì² «
ã ĥ
Ġë³ ĳ
ê ¾¸
ot e
Ġê³Ħ ìĨį
e ver
ĠëĨ ĵ
ĠìĿ´ ìłľ
Ġë¨¹ ê³ł
Ġf il
Ġì§ģ ìłĳ
Ġw ay
ĠU n
l og
Ġas s
ĠĠĠĠ ĠĠ
ĠíĶ Į
Ġa v
iz ation
Ġìłľ ê³µ
e e
ìŀĲ ìĿ¸
in es
vel op
o od
^ {\
ĠìĹ¬ íĸī
v alue
cl ude
ëį ķ
ĠìĹĨ ìĿ´
ĠìķĦ ë¬´
ph i
e y
r ic
ê· ł
av a
Ġì ¼
d ate
ê·¸ëŀĺ ìĦľ
Ġëĵ ¯
Ġ/ **
s on
Ġì¡ ´
C ol
a ut
Ġpro cess
Ġëĳ ĺ
· °
ĠìĤ¬ ìĹħ
Ġc ould
S E
ê· Ģ
com m
ĠìķĦ ì£¼
ĠA s
l ambda
ëĭĺ ìĿĺ
in ess
ser v
al ity
Ġê ¶Į
Th is
ĠìķĬ ìĿĢ
Ġdo es
c ed
Ġin formation
Ġëª °
Ġs ame
ë¦½ ëĭĪëĭ¤
Ġìĺ¬ ëĿ¼
ìŀ ¡
Ġev en
Ġê ¿
Ġ& &
Ġíĺ ¼
íĮĮ íĬ¸
ìĽ ł
ìłĦ ìĹĲ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ì§Ģ ë§ī
ëįĶ ëĭĪ
Ġìĥģ íĥľ
ire d
Ġs ign
ìŀ¥ ìĿĢ
b f
Ġìī ½
Ġf inal
are nt
n b
Ġë°ľ ìĥĿ
Ġíķĺ ë£¨
ë´ ¤
ìī ¬
Ġë³´ ë©´
Ġf ield
Ġìĸ´ëĸ »ê²Į
ro l
Ġin clud
Ġgo od
ap t
an n
Ġ{ \
er g
if y
Ġc al
Ġ ?
or g
Ġìĥ ī
ìĻ ķ
ĠìĨĮ ê°ľ
ent ial
ĠìķĮ ìķĦ
ĠC on
Ġex t
ìĿ´ ë©°
Ġë ķ
ìĬ ¬
íļ ¨
íĥ Ī
ĠëĺĲ íķľ
t il
Ġp ol
ìĿ´ ìĸ´
A s
re d
le ction
ers on
ur ing
ê¹Į ìļĶ
S et
ĠìĿ´ íĽĦ
u ild
pl ay
ĠìĿ´ ìĸ´
em ber
â Ļ
ar ray
***- ***-
R e
ìļĶ ìĿ¼
Ġë² Į
Ġap pro
Ġê´Ģ ê³Ħ
it t
ìĪ Ļ
ĠìĹŃ ìĭľ
ë§ Īëĭ¤
ak ing
' )
ĠìĿ´ ë¦Ħ
ĠìķĮ ëł¤
ìŀĲ ë¥¼
ìĹĪ ìĸ´ìļĶ
o ad
ìĬ¤ ë¥¼
ìģ ľ
em ent
f ace
Ġì¤ĳ êµŃ
ĠíĴ į
Ġh t
Ġs he
ĠìĬ ¹
ë² ¤
ind ow
7 0
ĠE x
Ġê¹ ¨
Ġre p
Ġob ject
ê»ĺ ìĦľ
vers ion
Ġc all
ĠíĶ¼ ë¶Ģ
ï ¼
Ġ key
Ġë°Ľ ìķĦ
h er
ical ly
oth er
w idth
] ;
Ġê±´ ê°ķ
w w
íĸĪ ìĬµëĭĪëĭ¤
Ġs er
íķĺ ìĺĢ
Ġì£¼ ë¬¸
ìĹĪ ëįĺ
Ġo per
Ġëı Ī
ar s
Ġor der
if e
al ign
ì° ®
ì§Ģ ê°Ģ
Ġê¸° ëĮĢ
D E
Ġíļ¨ ê³¼
ìĤ¬ ê°Ģ
ìĬ ¨
e k
Ġë°© ë¬¸
Ġde c
Ġìµľ ê³ł
Ġì§Ģ ëĤĺ
ëĶ °
a ction
Ġìłľ ê°Ģ
Ġg reat
cc ess
ìĪĺ ê°Ģ
ĠìĿ¼ ë³¸
Ġìĺģ íĻĶ
i ence
tr y
Ġim port
ìĬ¤ íģ¬
Ġíķ´ ìĦľ
ëĿ¼ ìĿ¸
íĹ Ī
***-***- ***
Ġb est
ì¿ ł
ëĭĺ ìĿ´
m er
ĠìŀĪ ëĬĶëį°
f ile
Ġbec ause
íĴ į
p x
ìĿ´ìĹĲ ìļĶ
ìĻ Ħ
Ġìļ ¸
ìķ Ļ
Ex ception
íķ´ ë³´
Ġ ed
F or
it ed
Ġb us
Ġs ur
ĠìķĬ ìķĺ
( $
Ġb el
íķĺ ëĤĺ
nb sp
Ġwh ile
Ġat t
==== ====
âĶĢ âĶĢ
ìĶ Ģ
E n
Ġí ľ´
in s
ĠëĮĢ íĳľ
ëĭ ¥
ĠíĺĦ ìŀ¬
um n
ĠìĹ¬ ê¸°
ìĿ´ ìĹĪëĭ¤
9 0
Ġd own
c m
rr or
ìĿ´ ë²Ī
Ġê°Ģ ì§Ģê³ł
" )
5 00
t en
ĠíĮĲ ë§¤
Ġë¶ ģ
íĺ ĳ
êµĲ ìľ¡
Ġëĵ± ìĿĦ
? "
ë¯ Ģë¡ľ
ìĿ¸ ê°Ģ
Ġv is
mathb f
A t
Ġ %
ĠíĻ į
if ied
ĠH e
3 3
g ram
Ġsup port
lo ad
] ,
Ġm at
il on
ìķĪ ëħķ
Ġìĸ¼ ë§Ī
Ġh ere
O bject
Ġ å
ps ilon
Ġêµ °
c d
con t
ê°Ļ ìĿĢ
Ġì ¸
ì£¼ ìĿĺ
Ġëĵ¤ìĸ´ ê°Ģ
í Ľ
ce pt
Ġ z
ĠíĴ Ģ
ì¸ ¡
at us
ĠìĿĺ ë¯¸
m e
ë¶Ħ ìĿ´
n et
in ter
ëıĻ ìķĪ
ì° Į
ìĥģ ìĿ´
Ġr un
Ġíķ´ ìķ¼
ì§Ģ ìļĶ
Ġê°ľ ìĿ¸
ĠìĽ Ķ
re qu
ì¹ĺ ëĬĶ
ess ion
\ \
Ġê¸ ī
Ġ// /
Ġc urrent
Ġst atic
ë§ İ
Ġpr ivate
ãħĭ ãħĭ
Ġpart ic
ĠìŀĪëĭ¤ ëĬĶ
o k
Ġto p
Ġdes ign
Ġg l
u ff
Ġyear s
Ġbe fore
ĠìĤ¬ëŀĮ ìĿ´
c es
e v
p ly
Ġ! =
ate g
Ġb oth
Ġë¯ ¿
ìĬ¤ ëŁ¬
ĸ ìĹĲ
ĠT r
. _
ĠìĪĺ ëıĦ
Ġpl ay
str uct
ĠëĶ ±
ìħĶ ìĦľ
Ġprov id
íķĺ ìĭľ
g er
ëł¥ ìĿ´
ĠëįĶ ìļ±
Ġm on
s ize
ĠëĨ į
Ġm ark
Ġì² ł
íķľ êµŃ
ĠìĹĦ ì²Ń
íĺ ľ
Ġf act
Ġg u
Ġn on
Ġê¸° ìĹħ
m ary
ro id
M E
Ġë¨¹ ìĸ´
ch n
s igma
ang le
ro ll
b eta
ĠìĤ ¶
Ġì ħ
is hed
t est
Ġm uch
ì ©
3 5
ë Ń
ëĦ Ĳ
C O
ëĵľ ëĬĶ
ëĦĪ ë¬´
enc y
Ġì¶ ķ
ìłķ ìĿ´
ê° ĳ
ê ½ĥ
Ġf ile
Ġë³´ ëĤ´
ar n
ìĽ ĥ
Ġë¶ Ļ
T est
ist s
d is
Ġt ake
Ġ( \
en se
qu e
r ite
Ġdis c
ĠS tring
re n
Ġìĸ´ ëĬĲ
ë¦¬ ìķĦ
Ġìĸ´ ëł¤
loc ation
olut ion
G et
ìĿ´ ìĬ¤
Ġìĥģ íĴĪ
ìŀ Īëĭ¤
Ġíı¬ íķ¨
Ġex pect
ĠíĮ Ķ
ëıĻ ìĿĦ
Ġë§Ĳ ìĶĢ
íķĺëĬĶ ëį°
Ġd on
ìĭľ ìĹĲ
Ġ ***
Ġë¹ ¨
Ġprodu ct
Ġìļ´ ìĺģ
ual ly
ê´Ģ ë¦¬
Ġre sp
Ġf r
ĠìķĦ ì§ģ
ë ·°
ìľ¼ ëĤĺ
Ġê°Ļ ëĭ¤
ìļ ķ
f unction
Ġf ound
ëıĦ ë¥¼
} {\
4 5
ìĬ¤ íĮħ
ot t
b s
ê±° ë¦¬
ĠìĿ¼ ë°ĺ
Ġê ¶ģ
Ġê²ĥ ëıĦ
Ġíĸī ë³µ
ëĤĺ ëĿ¼
ë¡ Ń
Ġíĺ ĳ
as es
Ġgiv en
Ġëĸ ¨ìĸ´
() .
Ġl ast
Ġëħ ¼
^{ -
ìŀ Ķ
Ġì¶Ķ ê°Ģ
Ġsm all
Ġë§Į ëĤĺ
ra w
Ġde velop
ĠA l
Ġíı Ń
ĠëĤ´ ëł¤
Ġâ ĸ
ĠìĬ¤ íĥĢ
Ġê ½ĥ
ëŀ µ
d ition
() );
ë¬¼ ìĿĦ
Ġo wn
ord er
Con t
ìķĪëħķ íķĺìĦ¸ìļĶ
Ġê°Ģ ì§Ģ
ëį ¸
. ,
are d
ĠìĦľ ë¹ĦìĬ¤
3 1
Ġbe ing
ìłķ ë³´
ĩ ´
ì¡Į ëĭ¤
t ime
Ġd ay
ĠA r
Ġê¸° ìĸµ
ĠìŀĲìĭł ìĿĺ
6 4
Ġë¿ Ĳ
Ġíķĺ ë©´
Ġë¨ ¼ìłĢ
ìĤ¬ ëŀĮ
ut il
ou se
an ag
ĠìĻ Ķ
ìĬ¤ ë¡ľ
er n
ì§Ģ ìĹŃ
Ġë° Ģ
Ġë¬´ ìĹĩ
Ġê¸° ëĭ¤
Ġêµ¬ ìĦ±
fig ure
ĠìŀĪëĭ¤ ê³ł
Ġeff ect
le ase
ë¥´ ê²Į
âĺ ħ
Ġ ãĢ
ail able
Ġë§Ĳ íĸĪëĭ¤
Ġì¹´ íİĺ
us s
us h
Ġf in
I m
ĠëĤ ®
ìĤ¬ ìĿĺ
Ġs ize
êµ¬ ëĤĺ
Ġê·¸ ê²ĥ
al th
le ar
ĠA n
ab ility
ens ion
ëĪ Ī
Ġth ose
ĠìŀĲ ìĹ°
m od
t op
Ġê°Ģ ì¡±
ìĤ¬ ìĹħ
Ġê³µ ê°Ħ
Ġc ar
Ġ est
b y
he ad
E rror
Ġê¸° ìĪł
Ġê·¸ ëłĩ
math rm
ĠìľĦ íķ´ìĦľ
ëħ ģ
ìĿĮ ìĿĦ
ì£¼ ê³ł
Ġì°¨ ëŁī
re ak
Ġíķĺ ì§Ģ
Ġìŀĳ ìĹħ
ĠëıĻ ìķĪ
Ġê´ ľ
l ess
ëĦ ·
L L
f l
Ġper form
* }
Ġcons ider
ëĬĶ ì§Ģ
ìĿ¸ ìĿĺ
ĠìŀĪ ìľ¼ë©°
s cript
Ġt erm
ëĵ¤ ìĸ´
ìĺĪ ìļĶ
Ġh ome
íħ Ĳ
ĠìĿ´ íķ´
ë¨¸ ëĭĪ
ì´ Ŀ
ìĹĲ ìļĶ
le te
Ġvar i
ìķ Ĭ
Ġê´Ģ ìĭ¬
ëĤĺ ìļĶ
ìĤ¬ ëĬĶ
ìĽĲ ìĿ´
Ġê¸° ì¤Ģ
ìĭľ íĤ¤
I C
Ġall ow
Ġê²ĥ ìŀħëĭĪëĭ¤
ìķ ŀ
E D
ëıĦ ë¡ľ
u c
ê°Ģ ê²©
op y
+ \
al k
g amma
ĠìĿ´ ë£¨
R O
Ġm ust
ìĿ´ ëłĩê²Į
Ġìº Ĳ
ëĬĶ ëĭ¤
Ġf am
r c
ì¹ ł
ĠìĽ ĥ
ĠìķĮ ê³ł
ë§Ī íĬ¸
Ġì° ©
ë§Į íģ¼
Ġê³Ħ íļį
ar ge
ĠìĿ´ìķ¼ ê¸°
Ġê¸° ë³¸
Ľ °
Ġê·¸ëŀĺ ìĦľ
ĠìĹĦ ë§Ī
ëıĻ ì°¨
ìĪĺ ë¥¼
A C
ìĭ ¶
Ġcont ain
on d
i k
cri ption
ĠìĿĮ ìĭĿ
ant s
ĠíĹ ¤
as on
Ġbus iness
ë¥´ ëĬĶ
ath er
oc i
ĠíķĻ ìĥĿ
ê·¸ ëŁ°
ĠS e
Ġs k
Ġm ain
Ġe as
n ess
ìĭľ ìķĦ
í ľ´
t able
Ġê¹ Ķ
ì£¼ ìĦ¸ìļĶ
ìĽĲ ìĿĦ
Ġ ãħłãħł
Ġm ade
l ink
ĠíĶĦ ë¡ľ
Ġê´Ģ ë¦¬
U n
ĠìķĦ ëŀĺ
Ġle t
Ġm ed
ëª »
Ġpos s
ê ¿
ĠìŀĲ ê¸°
ìĿ´ ë¥¼
] {
ĠR e
ê³ ¤
ect ed
Cl ass
Ġë £
ro p
B y
Ġd i
Ġ Z
Į ĵ
ë¦¬ ìĸ´
íķĺ ìĺĢëĭ¤
ĠC l
Â·Â· Â·Â·
g r
Ġag ain
Ġíİ ĺ
Ġpro ble
Ġsa id
ak es
ìłľ ë¡ľ
' );
ì ĵ°
ëĮĢ íķľ
w ay
ëıĦ ê°Ģ
h ip
A n
oc ument
o ot
ĠìĦ¤ ì¹ĺ
ìĿ´ íģ¬
Ġle ad
ìłĢ ëĬĶ
^ \
Ġê¸° ë¡Ŀ
ìĦľ ìļ¸
Ġë ī´
Ġê·¸ ëłĩê²Į
l er
ìĺ¤ ëĬĶ
Ġc heck
ìŀĲ ê¸°
ĠìĥĪ ë¡ľìļ´
ë¡ľê·¸ ëŀ¨
ĉĉĉĉ ĉ
ĠìĿ ĳ
Ġê¹ Į
res pon
ìŀ¥ ìĹĲ
ur l
Ġìĸ »
íķĺ ìĭľëĬĶ
Ġë³´ ëĭĪ
ëı ¼
ìłķ ë§Ĳ
re m
d elta
ind ex
ĠêµŃ ëĤ´
l ist
Ġìĸ¼ êµ´
Ġê°Ĳ ìĤ¬
r al
íĶ Ī
ro ss
Ġìĸ´ ëĶĶ
p ace
Ġp aramet
3 6
ĠìĤ´ ìķĦ
Ġbu ild
ìĦ¼ íĦ°
ĠìķĬ ìĿĦ
I nd
Ġê ½
ë¬¼ ìĿ´
Ġp ass
Ġin s
Ġe lement
[ '
Ġar g
f e
Ġì ĵ
ìļ´ ëį°
ĠìĻ ķ
Ġëĭ µ
ĠìĥĿ íĻľ
ê» ´
Ġê³ł ë¯¼
k en
V iew
Ġin cre
ëįĶ ëĿ¼ê³ł
g o
ĠíĻľ ìļ©
it ial
) }
Ġp erson
ì¤ĳ ìĹĲ
p m
ëĤ´ ê°Ģ
ìĬ¤ ëŁ½
ê¸° ìĹħ
ëĿ¼ ëıĦ
is ter
ì² Ļ
Ġê°ľ ë°ľ
ì§Ģ ê¸Ī
ìŀ¥ ìĹĲìĦľ
ê°ľ ìĽĶ
Ġev ent
the ta
ìĽ ĢìĿ´
Ġch ild
m ed
íķĺ ëĭĪ
Ġresult s
Ġì¹ ¨
n a
ĠA nd
0 1
ĠìŀĪ ëıĦë¡Ŀ
ìĬ¤ íĦ°
íĸĪ ìĸ´ìļĶ
g round
ur ation
em pl
r ho
ë¡ľ ëĤĺ
ëł ´
Ġëĵ± ìĿĺ
íķĺ ìĭł
Ġìĭ ¸
ìĽĢ ìĿĦ
p ublic
Ġp ost
ĠìĻĦ ìłĦ
Ġd irect
" ;
ë£Į ë¥¼
Ġ| |
Ġìľ ¡
Ġre al
K ey
Ġd id
iv ely
a z
ĠS h
] .
Ġê¸° ëĬ¥
Ġê°Ģ ëĬĶ
R equ
Ġloc al
re g
Ġì°¸ ìĹ¬
w are
Ġht tp
ë§Į ìĹĲ
Ġ ke
} ;
ĠíĬ¹ íŀĪ
0 5
ir c
et work
ì° į
Ġìĭ¶ ìĿĢ
ut e
erv ice
í ĮĢ
ëĨ į
ìĥģ ìľ¼ë¡ľ
Ġc ent
ĠëĨĴ ìĿĢ
ëł¸ ëĭ¤
se arch
Ġê³ł ê°Ŀ
ëŁ¬ íķľ
Ġc ustom
j s
ĠìłĦ ì²´
Ġìķ ī
ĠíĻ Ī
Ġê ¾¸
ë »
w ays
is ion
ëĭ Ŀ
ìĬ¤ íħľ
b ers
sum mary
ë¬¸ ìĹĲ
ar m
Ġìĺ Ĩ
Ġë° ¥
Ġerr or
() ,
ĠíĦ °
com e
Ġar t
Ġê²½ íĹĺ
ëł µ
ĠìĬ ¬
Ġë¨¹ ìĿĦ
íĸĪ ëĬĶëį°
íĽ Ī
Ġíĥ Ħ
le q
ìĬ¤ ê°Ģ
íĬ¸ ë¥¼
íĭ Ģ
. </
ì¹ĺ ë¥¼
Ġìĺģ íĸ¥
ĠìķĪ ìłĦ
Ġì ¿
Ġpro ject
S h
Ġse cond
r on
Ġíķ´ ëĭ¹
ê°Ģ ëĬ¥
Ġìī ¬
ì¼ ĵ
Ġìŀĳ íĴĪ
ê±° ëĵł
ĠëĤĺ ìĺ¨
ì§ Ĳ
Ġê±° ìĿĺ
ìĭ¬ íŀĪ
$ -
ë¦¬ ì§Ģ
Ġtr y
Ġwor ld
Ġëĵ £
Ġf ree
"> </
end s
ĠëĤĺ ìĻĢ
Ġle vel
olog y
Ġì¸ ¡
ĠíĻ ©
ëįĶëĿ¼ê³ł ìļĶ
v ious
Ġê³µ ë¶Ģ
ìĿ´ ìłľ
Ġë¬¼ ë¡ł
Ġth ink
P E
Ġìķ ħ
ĠìĿ¸ ê°Ħ
ľ ĺ
ta u
Ġfollow ing
h or
ì£ ½
ëıĻ ìĤ°
se c
Ġë´ Ĳ
ĠìĺĪ ìłķ
I ON
ë²Ī íĺ¸
ch ool
Ġcont in
Ġav ailable
Ġstr uct
í ĳ¸
ī ìŀ¥
Ġê· ¹
Ġìŀĳ ìĿĢ
ëŀ Ļ
ĠëĬ ¥
g ht
b ig
Ġê²° ìłķ
Ġìĸ¸ ìłľ
íĻ į
Ġa round
ëĶĶ ìĸ´
Ġserv ice
ìĺ ¥
ack age
Ġìłķ ë¶Ģ
n av
plic ation
Ġd r
Ġs om
if t
ê²ĥ ëıĦ
tribut e
ìľĦ ìĽĲ
Ġíĳľ íĺĦ
ĠìĹ¬ ìĦ±
ur al
ë ķ
ĠĠĠĠ Ċ
ãħ ¡
Ġn ext
Ġm em
Ġë¶Ħ ìľĦ
L A
ar row
Ġê± ±
le x
I f
3 00
og le
íĦ ´
ìĹ ĺ
Ġ ve
Ġd el
Ġê²½ ìłľ
Ġë§Ī ì§Ģë§ī
Ġm ult
ê º¼
}$ ,
ĠN ew
Ġte chn
Ġë° ¤
ëĿ¼ ìĦľ
Ġë³´ ìĿ´
t imes
ĠíķĻ êµĲ
}$ .
ĠìĿ¸ íĦ°
F ile
Ġc r
ĠíķĦìļĶ íķľ
Ġë©Ķ ëī´
p ath
Ġrequ est
ëĲ ©ëĭĪëĭ¤
ìĭ ±
Ġm et
per t
P I
un c
s m
Ġê´ľ ì°®
iv es
ħ ëĭĪëĭ¤
Ġë§¤ ìļ°
êµ° ìļĶ
ë³´ ëĬĶ
Ġcon dition
y mb
ì¹ Ļ
Ġë°Ŀ íĺ
Ġ æ
v ed
ë¨ ¼
S e
3 4
T E
Ġíĭ °
ĠëıĦ ì°©
ri x
Ġpro gram
tr act
' ]
ĠìĤ¬ëŀĮ ëĵ¤ìĿ´
Ġth ree
ĠíĪ¬ ìŀĲ
Ġop en
Ġíı¬ ìĬ¤íĮħ
f il
ê² ¼
ìľ µ
Ġim age
ĠëĲĺ ê³ł
ìĭ ¸
Ġìŀ Ķ
a pe
ìĿ´ ëĵľ
D e
ĠìķĦ ì¹¨
ã İ
el s
Ġan al
Ġê¸° ìŀĲ
Ġíĺ ¹
is m
sp ace
ĠìĪ Ļ
ëĵľ ë¦¬
Ġg roup
ìĬ Ī
Ġë Ł
íĨµ ëł¹
ì¼ ĢìĿ´
Ġê·¸ëŁ¬ ëĤĺ
ĠìłĢ ëĬĶ
s l
Ġë¶Ħ ìĦĿ
ìĹ¬ íĸī
i vers
Ġë¹Ħ êµĲ
T ime
O n
Ġwe ek
íı Ń
it ive
v ir
Ġt yp
con st
ìŀ ĺ
ymb ol
Ġë°Ķ ëĿ¼
m m
Ġë© ĭ
Ġë³´ ëĬĶ
Ġê¿ Ī
Ġë Ľ°
Ġcre ate
ì¤ ĺ
ìļĶ ì¦ĺ
Ġëľ »
St ate
ë°Ķ ë¡ľ
Ġìłģ ìļ©
l ay
} (\
Ġl ife
ë¥´ ë©´
ìĸ´ ëıĦ
ĠìĨ ¡
ë³´ ê¸°
E lement
ë°© ë²ķ
Ġp resent
Ġê² ¨
Ĩ į
Ġìĥģ ëĭ´
um er
ain ing
Ġst and
eq ref
t ps
Ġ );
Ġwith out
ĠëĬĲ ê»´
Ġst ill
ëĤ ¸
Ġre f
ê ´
ë¥´ ê³ł
ìĿ´ ëŀĳ
Ġcomm un
Ġp at
Ġìľł ëªħ
Ġìµľ ê·¼
/ *
ëłĪ ìĬ¤
ìľ ¤
ĠëĮĢ íķ´ìĦľ
ìĥģ ìĿĺ
ë¡ľ ìĦľ
ĠìĿ µ
Ġë² Ķ
ëĭ¤ ìĿĮ
W ith
ĠTh ere
ã Ħ
Ġê° ĳ
it or
Ġìļ´ ëıĻ
part ial
Ġc oun
7 5
Ġpl ace
ail s
i or
ĠíĿ Ĳ
fer ence
íķ´ ëıĦ
Ġ$ (
ìĻ Ķëĭ¤
Ġì ı
I nt
E vent
Ġv iew
ìłĲ ìĿĦ
Ġìĭľê°Ħ ìĿ´
Ġpl an
Ġs ing
ĠíĿ ¬
u se
ĠêµŃ ê°Ģ
Ġp ur
Ġì¢ĭ ìķĺ
ĠR es
ã Ĩį
Ġs ince
9 9
m et
Ġ/ >
A dd
v en
" :
ter s
f ield
Ġë°° ìļ°
n ode
Ġì¡´ ìŀ¬
N ode
T R
p oint
Ġë§Į ì¡±
ë²Ī ì§¸
Ġth row
Ġê²Į ìŀĦ
Ġìľł ì§Ģ
er ing
ëĭ¤ ë¥¸
Ġl im
l ength
Ġsp ace
íķĻ ìĥĿ
ĠëĶĶ ìŀĲìĿ¸
ct or
Ġcont ent
ĠìĿ¼ ìĿ´
ĠìŀĪ ì§Ģë§Į
ëª °
Ġl og
Ġì¦Ŀ ê°Ģ
ë³´ ë©´
Ġì¢ĭìķĦ íķĺëĬĶ
ĠíĻľ ëıĻ
Ġë°Ķ ëŀĮ
ì» ¨
s w
ĠD e
cal e
íĺ ¹
Ġê·¸ ë¦¼
5 5
ìķ ķ
T ext
Ġì¤ĳìļĶ íķľ
ĠìĥĿê°ģ ìĿ´
ìĬ ´
Ġíŀĺ ëĵ¤
Q u
19 8
Ġê° Ķ
U R
Ġìĭł ì²Ń
ìĭľ ìĦ¤
íĿ ¥
Ġì į¨
Ġt ext
ìĸ´ ìķ¼
0 4
ëĤĺ ë¬´
b ox
ë¿ Ĳ
ì´ Į
ê ¶ģ
Requ est
Ġì¦ ī
! --
al e
ĠH ow
a it
em s
n u
Ġë§Į ëĵł
Ġhe ad
Ġus er
ĠìłĦ ìĹĲ
Ġë¨¹ ëĬĶ
ĠìŀĪ ìľ¼
=" ../../
Ġíģ¬ ê²Į
Ġíĥ Ī
l ock
ft y
Ġëĭ¤ ëħĢ
ìĽĲ ìĿĺ
ĠìĿ´ ê²ĥ
ëı Ī
¯ ¤
ĠìŀĲ ìĦ¸
s q
ìŀ ĸ
ìłľ íĴĪ
ìĥĿ íĻľ
Ġw rit
w ord
0 8
iss ion
' :
enc es
3 8
ific ation
Ġval ues
ê²ł ì§Ģë§Į
wh ere
col or
ĠíĻĺ ê²½
ìŀ¥ ìĿĺ
ëľ »
Ġc our
íļĮ ìĿĺ
av ing
ëª ¬
ëŁ ´
Ġë§Į íģ¼
ëĵľ ë¦½ëĭĪëĭ¤
ĠìļĶ ì¦ĺ
` `
ê¸° ê°Ħ
ìĪĺ ëĬĶ
Ġb ook
Ġìķ Ķ
Ġadd ition
íķľ íħĮ
ĠìķĦ ë¦Ħ
p p
Ġ ide
Ġë§Ľ ì§ĳ
Ġas sert
ìĿ¸ ìĿĦ
ac es
oc us
Ġs l
Ġëĭ¹ ìĭł
le m
0 9
oo lean
ĠëĦ ĵ
Ġt itle
Ġì»¤ íĶ¼
ëĮĢ ë¥¼
us er
at t
ĠìĿ´ ëıĻ
ê³ł ì°¨
ìłľ ë¥¼
/ **
ê°Ĳ ìĿĦ
it al
a h
=" +
Ġëħ¸ ëŀĺ
Ġar ray
ìĬ¤ ëĬĶ
ì§Ħ ëĭ¤
g roup
ĠëĬĲ ëģ¼
Ġìĺ¤ ëŀĺ
ë¹ Ľ
o ard
" "
ä º
ìĿ´ íĦ°
Ġìĺ¤ íĽĦ
Ġad v
in fty
Ġê°Ģ ìł¸
| \
ĠìĦ± ê³µ
pt y
P h
Ġíıī ê°Ģ
id ent
til de
ìĹ° êµ¬
Ġre ce
ë¹ Į
ë¬¸ íĻĶ
ìĹĪ ê³ł
om ega
ĠíĬ¹ ë³Ħ
Ġê´Ģ íķľ
âĸ ¶
ab l
Ġìŀ¬ ë¯¸
ĠêµŃ ë¯¼
Ġíķ´ ê²°
Ġìĸ´ ë¦°
st and
Ġof fer
a j
ì½ ĺ
Ġìłľ ìŀĳ
Ġwith in
3 9
Ġì¢ĭ ìĿĦ
i que
Ġë ŀ
Ġre ally
P ath
Ġob tain
Ġëħ ¹
orm al
ìľĦ ë¥¼
Ġacc ess
ĠíĶĦ ë¡ľê·¸ëŀ¨
Ġs ol
Ġinter est
ìĿ´ ìķ¼
Ġë¬¸ íĻĶ
Ġìĸ ĺ
Ġë³´ ìĿ´ëĬĶ
ĠO n
as ure
Ġl arge
In fo
ĠìĪ ł
Ġì¤ĳ ìĭ¬
Ġë°Ŀíĺ Ķëĭ¤
Ġt arget
¬ ìĺģ
er tain
I S
os s
ëªħ ìĿ´
ob al
M A
ĠìĿ´ ë¥¼
ì´ ī
ëĲĺ ì§Ģ
ê² ģ
Ġpro t
E qu
ê° Ķ
v es
Ġ/ *
Ġì°¸ ê³ł
m ap
Ġf ew
Ġal ways
ìĿ´ ë²Ħ
ìłģ ìĿ´
ĠìŀĲ ì£¼
ë§ ¨
pert ies
i ents
Ind ex
ĠìķĬ ìķĦ
ì¹ľ êµ¬
f in
Ġto o
Ġê¶ģ ê¸Ī
Ġprov ide
íķĻ ìĽĲ
0 2
F ield
ì£¼ ìĭľ
ìĤ¬ ìļ©
Ġêµ¬ ìŀħ
0 6
ê±°ëĵł ìļĶ
ìĤ¬ ìĭ¤
Con text
Ġì¹ĺ ë£Į
ë²¤ íĬ¸
Ġë´ ¤
íĤ ¹
Ġê·¸ ëĬĶ
ëĲ Ĳëĭ¤
3 7
n o
t ab
et y
A D
ĠëĶ° ë¥¸
Ġt ri
ĠìĤ¬ ê±´
Ġë© Ģ
ĠìłĢ íĿ¬
ĠíĿ Ķ
0 7
Ġle ft
Ġte am
Ġd uring
Con fig
ou ble
ĠìĤ¬ ê³ł
ĠìŀĲ ì²´
ìĿ´ ëŁ°
Ġex pl
as ter
en u
D elta
() )
® ¤
d es
ĠíĴ Ī
ĠëıĦ ìĭľ
st ance
i um
Ġê°Ģ ê¹Į
ìĨ Ķ
ìĸ´ ê°Ģ
ìĿ¼ ìĿ´
ì» ¬
Ġíķ´ ìļĶ
ë¡ ¯
Ġë°© ìĨ¡
ë Ĵ
Ġp ower
Ġrequ ire
Ġm ax
% )
Ġde v
old s
Ġê¸ ´
D ef
ë§ ŀ
Ġë§Ĳ ìĿĦ
ê¹ ¨
ì£¼ íĥĿ
Ġìī½ ê²Į
iv ed
íĮ Ķ
Ġf ull
ìĺ¤ëĬĺ ìĿĢ
pl oy
Ġë°Ķ ëŀįëĭĪëĭ¤
Ġì» ¨
ê°Ĳ ìĿ´
Ġê²½ ê¸°
ìĹŃ ìĭľ
Ġìĺ ·
ì¶ °
ĠëĮĢ íĨµëł¹
Ġen erg
ì¦ Į
Ġíķĺ ìĹ¬
ìĿ¸ ëĭ¤
iv ity
M ap
ì½ ¤
Ar ray
eq n
Ġp ar
Ġê·¸ ìĿĺ
qu ad
ut ton
ames pace
at ely
o ff
ë³´ íĹĺ
in ation
u i
l and
Ġimport ant
ater ial
ì¹ Ń
I G
Ġo ptions
ap er
Ġ: )
Ġp ath
Ġm ap
ĠìłĢ ëħģ
Ġ} ,
our ces
pos ition
íĨ ¡
ê³ł ê¸°
Ġo pt
m an
r t
Ġê¹ Ĭ
g g
Ġìľ ¤
p or
ìĽĲ ìĿĢ
qu ot
Ġë°ľ íĳľ
Ġ( !
at s
tern al
res ult
ìĦł ìĿĦ
Ġí ĳ¸
ĠìĹ´ ìĭ¬íŀĪ
Ġid ent
Ġdef ault
Ġíķĺ ëĬĶëį°
Ġb ound
r ide
ĠìłĦ íĻĶ
ĠìķĦ íĮĮíĬ¸
Ġë¶Ģ ëĭ´
+ +
Ġë°Ľ ê³ł
ens ure
anag er
Ġh app
id d
Ġìłľ ëĮĢë¡ľ
ì ĩ¼
Ġëĵ± ìĿ´
i ver
at ures
ë§ ¥
iv ing
v oid
ĠìĽ Ģ
Ġc ode
Ġê³¼ ìłķ
Ġê¹Ķ ëģĶ
L O
Ġë³´ ëĭ¤
ĠëĮĢ ë¶Ģë¶Ħ
Ġh im
Ġex ample
ëŁ Ń
ĠìŀĲ ë¦¬
ì¹´ íİĺ
Ġb ased
Ġinclud ing
A ll
ë¦ ¿
ĠíķŃ ìĥģ
Ġl ove
íĹ ¤
ìłĢ íĿ¬
ul ation
íĬ¹ íŀĪ
íĻĺ ê²½
ĠíĸĪ ëĬĶëį°
Ġd ist
ê·¸ëŀĺ ëıĦ
ë¬´ ë¦¬
ur s
ĠìĦľ ë¡ľ
ìĥģ ìĹĲ
ĠìĹ° ê²°
íĺ ģ
Ġì£¼ ë³Ģ
ĠìĹĨ ìĸ´
port s
ê°Ļ ìĿ´
ì½ ľ
l ang
íİ ´
ë£ ¸
ì ¯¤
ĠìĪĺ ìĹħ
Ġgo ing
Ġìĺ¬ ëł¤
pl es
Ġ et
Ġ Ð
4 8
í Ĥ¬
Ġë´ ī
Ġ: =
ap i
Ġch ange
il ar
Ġìĥģ ìĬ¹
O ver
ê¹ Ĳ
U T
ãĢ į
' ;
ĠìŀĪ ìľ¼ëĭĪ
Ġê°Ģ ìļ´ëį°
Ġë³Ģ íĻĶ
Ġl ight
ĠThe y
itt le
Ġis s
ìĿ´ ì§Ģë§Į
ìĨĮ ë¥¼
Ġbet ter
ĠìĽ Į
ĠìĨ Ķ
ìłĦ ë¬¸
x i
Ġrep resent
ìĭĿ ìľ¼ë¡ľ
ì§Ģ ìĽĲ
Ġí į¼
ëĮĢ ìĿĺ
ìĿĦ ëķĮ
ëį° ìļĶ
it er
ìĦľ ëĬĶ
IN G
Ġch ang
. )
ìĿ¸ íĬ¸
Ġp ay
íı Ĳ
ĠìĪĺ ì¤Ģ
Ġì£¼ ëĬĶ
ëĺĲ íķľ
Ķ ê°Ģ
ë¹ Ī
g l
ê·¼ ëį°
Ġcol or
ab les
Ġ} );
ar i
Ġë¿ Į
Ġab ove
u f
ì¹ĺ ê³ł
ìĽĮ ìĦľ
## ##
ĠìĿ´ ëŁ¬íķľ
E T
ìĭĿ ìĿ´
Ġìłľ ìĿ¼
tr a
Ġb reak
ìĤ¬ ëŀĳ
Ġì ĩ¼
Ġex p
Ġc ost
ĠìŀĪ ê²Į
ĠC ol
ĠëĤ¨ ìŀĲ
S ervice
Ġs ure
Ġë¹ ¼
tr ue
íļĮ ë¥¼
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
Ġê·¸ ëĮĢë¡ľ
Ġmark et
Ġì¶© ë¶Ħ
ma x
empl ate
act er
ìłķ íķľ
Ġ ***-***-***
ì¶ ĺ
de pend
ê¸° ê´Ģ
ĵ ¨
Ġëħ¸ ëł¥
Ġin put
ìĹĨ ëĬĶ
ìĭľ ìŀ¥
con fig
Ġê·¸ ëħĢ
Ġëª¨ìĬµ ìĿĦ
Ġdis tribut
ap ache
Ġëı ¼
um p
ëŀ Ĳ
ag s
ëĳ ĺ
~ !
//// ////
íĺ Ī
íİĺ ìĿ´ì§Ģ
Ġìĸ¼ë§Ī ëĤĺ
Ġr ange
ĠìĪľ ê°Ħ
ë¡ľ ëĬĶ
bl ock
cd ot
Ġë¸Ķ ë¡ľê·¸
od es
ĠìĹ¬ ìŀĲ
Ġíķ´ ëıĦ
Ġìŀĳ ìĦ±
ĠìŀĲ ìľł
Ġìłķ ìĭł
ĠA ll
ĠB ut
ĠìĿ¼ ë¶Ģ
ĠI nd
ĠT o
ile d
Ġposs ible
ìĤ¬ ìĿ´
ob ject
ì¢ Į
ìľĦ ìĹĲ
ĺ ĳ
\ ,
Ġde pend
ëĮĢ ê°Ģ
Ġint eg
ì§Ģ ì§Ģ
Ġë¬¸ ìĿĺ
ê¸° ìĿĺ
ic on
Ġ= ==
ìĬ ·
ĊĊ ĊĊ
Ġ ]
ê²Į ìļĶ
íĸĪ ê³ł
Ġpos ition
ĠìĶ ¨
E S
Ġsu per
ê±° ìļ´
ëĲĺ ìĹĪëĭ¤
ëĭ¤ ìļ´
Ġn etwork
u ck
Ġbe g
M P
Ġph ot
ore m
ma il
in ition
ìĿ¸ ìĿĢ
D es
ìĿ´ ëŀĢ
A S
che s
íĨ ¤
ĠëĲĺ ìĹĪëĭ¤
B S
Ġb as
F F
Ġqu est
Ġke ep
Ġorg an
b ody
Ġê°Ģ ëĵĿ
ì§Ģ ìĹĲ
Ġcont rol
ĠW h
¨ ìĿ´
Ġë¶Ģ ìĤ°
O T
C H
Ġë¶Ģ ì¡±
ìĭľ ì¼ľ
Ġbl ock
ë§İ ìĿĢ
ìĿ¼ ìĿĦ
Ġìļ ķ
s im
ĠìĹ¬ ë¦Ħ
Ġcomp any
Ġo ld
C ode
$ $
vir on
ëĿ¼ ë§Ī
A l
Ġì¹ ¼
I P
th ing
ĠëĤĺ ìĻĶ
Ġc are
ë³´ ëĭ¤ëĬĶ
Ġë§ ¥
Ġe ar
Ġs it
d t
íķĺ ëĭ¤ê³ł
an e
Ġfam ily
Ġ-- >
ëįĶëĿ¼ ëıĦ
Ġë ½
ì į
Ġman ag
Ġë§ Ŀ
Ġg row
ff ic
Ġspec ial
íķĺ ìĭ¤
ìĿ¸ëį° ìļĶ
Ġan other
str u
in put
ë ļ
ëıĦ ìĿĺ
Ġenerg y
ìĽĲ ìĹĲ
pon ent
ì Į
ì ¥
Ġpro perty
Ġê²° êµŃ
Ġmon th
Ġn ode
ìŀĦ ìĿĦ
Ġg ive
F orm
ĠìĺĪ ìķ½
M L
ìł ł
Ġëį ķ
Ġíķ´ ì£¼
ĠìĿĮ ìķħ
O r
f rom
ple ment
4 4
ĠS o
m it
ìĿ´ ìĥģ
ê²ł ì£ł
d ing
Ġse lect
ĠëĶ ¸
Ġproble m
ĠëĤĺ ìĿĺ
Ġë¸Į ëŀľëĵľ
se e
íĭ ±
ĠìĥĿ ìĤ°
Ġê² ¬
ĠìĹŃ íķł
ib r
com p
ĠìĦł ë¬¼
val id
Ġw ater
press ion
Ġexper ience
Ġë ļ
Ġhe alth
ìłĲ ìĿ´
Ġë§Ĳ ìĿ´
Ġs ay
ìĶ ¬
ĠìĿ´ë£¨ ìĸ´
ëªħ ìĿĺ
Ġê°Ļ ìĬµëĭĪëĭ¤
íķ¨ ìĿĦ
ìķĦ ì£¼
Ġbe h
read y
0 3
Ġì± Ļ
Ġìĭ «
} [
ic le
he s
íħĮ ë¦¬ìĸ´
â Ĩ
ëĤ¬ ëĭ¤
ìĬ¤ëŁ¬ ìļ´
)$ .
yn c
S ize
ass ert
ĠìĦ Ŀ
raph ics
Ġë°Ľ ìĿĢ
Ġres pect
ëªħ ìĿĦ
Ġë§ ¡
ĠìłķëıĦ ë¡ľ
ne ction
******** ********
du ct
Ġpro f
ìłĦ ìĿĦ
Ġor ig
ĠìĬ¤ íĬ¸
Ġcomp ut
} }\
Ġê³µ ê°ľ
Ġcor re
Ġì» ¬
ìĦ ¯
ìĤ¬ íļĮ
Ġê¸° ê°Ħ
Ġp age
ìŀ ł
ĠëĲĺ ë©´
Ġíķĺ ê¸°
Ġê±± ìłķ
ul es
ëĭĺ ê»ĺìĦľ
ëģ Ĺ
ĠëķĮë¬¸ ìĿ´ëĭ¤
ë° ĸìĹĲ
¢ °
Ġë§Ī ëł¨
Ġcon f
íķĺ ìĭľë©´
ĠíĺĦ ëĮĢ
o in
í Ģ
uff er
le g
O f
Ġm ight
t ings
Ġre st
Ġì ª½
ur ity
ĠìłĢ ëł´
Ġserv ices
N ot
Ġab le
Ġp op
ĠìĿ¸ íķ´
Ġfe el
Ġp ut
Ġë°ľ ê²¬
ê°Ģ ê°Ģ
Ġl ess
t t
ott om
ĠìĿ¼ ìĿĦ
Ġíĺ¼ ìŀĲ
Ġìĸ´ ëłµ
ĠìĤ´ íİ´
anc es
Ġare a
m odel
Ġadd ress
Ġm ass
ht tps
ë ¢°
s k
Ġê·¸ ë¦¬
N S
[ ]
Ġì§Ģ ìĨį
Ġìķŀ ìľ¼ë¡ľ
Ð ¾
ĠĠ Ċ
able d
pec ial
Ġì¿ ł
ê³¼ ìĿĺ
st ate
ë² ¨
ì§Ħ ì§ľ
Ġs ource
ë§Į íķľ
ìķĦ ëĭĪ
c or
w ith
ĠëĤĺ ê°Ģ
íķľ ëĭ¤ê³ł
Ġs um
n ect
Ġêµ¬ ì¡°
ĠìŀĪ ê¸°
err or
et urn
ĠìĺĪ ìĥģ
Ġì¢ Į
ëĵľ ë¥¼
co pe
Ġí ĮĢ
p ed
ì ĩ
ĠìĹĨ ê³ł
ic y
cre ate
Ġê°ĢëĬ¥ íķľ
pl it
u x
Ġsu ccess
Ġst yle
Ġt em
Ġë ¥
Ġ version
Ġs pe
Ġ ãħİ
ĠìŀĪ ëįĺ
? )
it ch
Ġre du
ìļ° ìĬ¤
ur ther
Ġíı Ĳ
m d
Ġë¹ Ľ
ĠëĤĺ ëĿ¼
ĠëĤĺìĺ¤ ëĬĶ
Ġ čĊ
im al
ĠëĦ£ ìĸ´
ìķĺ ìĬµëĭĪëĭ¤
ëĶĶ ìĺ¤
ĠS ystem
Ġth ings
ix ed
or ies
Ð °
eth ing
Ġf ri
^ *
Ġp res
Ġs w
Ġinst ance
ë£ ¹
æ ľ
ĠìĽĢ ì§ģ
Ġcom e
ì§Ī ë¬¸
ì¢ĭ ìĿĢ
Ġìļ°ë¦¬ ê°Ģ
ìĤ° ìĹħ
m at
Ġìĥģ ëĭ¹
Ġë§ ĺ
Ġíķĺ ëĬĺ
6 6
ì¹ĺ ê°Ģ
Ġ ç
Ġl ow
Ġìĺ¬ íķ´
ĠG et
Ġl ittle
ìĤ¬ íķŃ
= '
ìłķ ë¶Ģ
e psilon
Ġt able
í ĵ¨
S ystem
Ġê°Ħ ëĭ¨
Ġìłķ ë¦¬
Ġê°Ģ ìĦľ
ì§Ģ ë¡ľ
ì£ Ħ
íĦ ¸
ĠìĿ¸ ìłķ
Ġë¬´ ë£Į
ìĪĺ ëıĦ
Ġh ard
ìĿ´ ê¸°
íķĺ ìŀĲ
Ġì¼ ĢìĿ´
ëī´ ìĬ¤
ìĶ¨ ê°Ģ
Ġìłķ íĻķ
Ġìĭł ê²½
A B
im um
ëĭ¤ ìĭľ
ar ning
íķĺ ê±°ëĤĺ
H and
ec ut
ê°Ģ ë¥¼
t itle
he ther
Ġëľ ¨
che d
Ġp ot
ë¦¬ ìĿĺ
Ġíķĺ ë©´ìĦľ
Ġind ex
It em
ëĿ¼ ë©´
å ¤
ĠìĪĺ ê°Ģ
our s
O S
er o
ë ĩ
Ġê²° íĺ¼
ìĿĢ íĸī
ĠíĥĢ ê³ł
ë¹Ħ ë¥¼
Ġìĺ¤ ëĬĶ
ì§Ģ ëĤľ
ĠìĤ´ ì§Ŀ
Res ult
ìĹ¬ ê¸°
ëķĮ ë¬¸ìĹĲ
ëł ī
c apt
Ġì§Ģ ë°©
ìĦ¸ ê³Ħ
ëıĦ ìĭľ
Ġe lect
ë§Į ìĿĺ
Ġinv est
ìĪĺ ë¡Ŀ
Ġíķĺ ë©°
Ð µ
Ġcon fig
is ed
ĠëĤ´ ë¶Ģ
ë¹ µ
ĠëĲĺ ìĹĪ
Ġim pro
Ġcon text
O m
Ġl ink
ë¬¸ ìĿĦ
ìĿĺ ë¥¼
ĠíĻĶ ìŀ¥
ĠìķĬ ìķĺëĭ¤
Ġì§ĳ ì¤ĳ
Ġs at
Ġì¢ĭ ëĭ¤
ì³ ¤
íĬ ľ
ps i
B uild
ìĪĺ ìĿĺ
ĠìĤ¬ëŀĮ ìĿĢ
ëŀ Ħ
en e
lo at
in clud
ëŀ ¬
ëĮĢ ìĹĲ
M essage
Ġap pe
Ġë² Ĺ
ĠìĿ´ ê³³
ord s
ëŀ «
ìĥĿ ê°ģ
å ħ
ëĦ ĺ
Ġpartic ular
ith er
4 00
Ġëĭ¤ ëĭĪ
Ġë°Ľ ìĿĦ
ìķĦ ê°Ģ
ĠF ig
ain s
ĠëĬĲëĤĮ ìĿ´
ĠP l
def ault
O O
) (
at ors
ê¸Ī ìĿĦ
ĠìĹ° ëĿ½
Ġen c
ĠìĦ± ìŀ¥
Ġë¹Ħ ìĬ·
Ġì½ ĺ
ìĿ´ ë¸Ķ
} _{\
def ine
I s
Ġë¬¼ ê±´
U N
ê° Ķëĭ¤
Ġìķ½ ê°Ħ
Ġa ff
Ġëķ ħ
íķĺ ëįĺ
ĠíĮ ¬
Ġc ap
Ġëª¨ ëį¸
Ġb ase
Ġon line
Ġë£ ¨
V al
Ġëĭ¹ ìĭľ
Ġê¸° ì¡´
ê´Ģ ê³Ħ
ìĿ´ëĿ¼ ë©´
íŀ Į
ëĭ¤ ëĭĪ
ë¶Ħ ìĹĲ
Ġëģ Į
Ġê·¸ëŀĺ ëıĦ
Ġìĭľ ìĬ¤íħľ
ê°ľ ë¥¼
ou ght
ë¡ľ ë¶ĢíĦ°
Ġë¶Ģ ëª¨
ì§Ģ ìĿĺ
ìĤ¬ ìĹĲ
ent ion
Ġìĭľê°Ħ ìĿĦ
Ġ- >
ref er
na ver
Ġt urn
. (
Ġc ur
D I
ìľ¼ ë©´ìĦľ
ir t
n al
ìĸ´ ëĸ
Ġë¶Ħ ëĵ¤ìĿ´
Ġw on
ord ing
Ġex c
â Ī
Ġacc ount
eqn array
Ġë³´ ê¸°
ìł¸ ìĦľ
Ġin clude
Ġìĺģ ìĸ´
ê²ĥ ìĿ´
Ġëª© íĳľ
U LL
Ġìłľ ì£¼
ĠìķĪ ëĤ´
ë¦° ëĭ¤
Ġsing le
st yle
ì¹ ¼
ìľ¼ë¡ľ ëĬĶ
ĠìłĦ ë§Ŀ
Ġìķ ķ
ĠìĦ ¼
Ġs chool
Ġto t
tain er
Ġas sum
ir d
Ġìĭľ íĹĺ
Ġì½Ķ ë¡ľëĤĺ
Ġì¢ħ ë¥ĺ
Ġo cc
ë¦¬ ë¡ľ
ëĳ ¥
Ġex ist
b t
íĶ ½
li ent
ë¡Ń ê²Į
ëĤ Ļ
om et
and s
i od
ëŁ¬ ìĬ¤
Ġë¹ Į
ĠëķĮ ëĬĶ
ĠìĨĮ ë¹Ħ
o le
ĠëĬ ¦
o ice
iv al
viron ment
ìĸ´ ëĤľ
F rom
Om ega
Ġê¸° ë¶Ħ
ë¬¸ ìĿĺ
Ġê³ł ëł¤
ĠU S
Ġì§ ľ
Ġj ava
ë¦ ĩ
6 5
ìī ½
o h
l im
4 9
ore d
Ġin itial
Ġpro b
Ġíŀ Ī
s ide
ĠìĹĨ ìĬµëĭĪëĭ¤
ëħĦ ìĹĲ
ac y
Ġ} ;
Ġ_ _
íķĺ ëł¤
ìĹħ ì²´
M odel
ad i
Ġcal led
pro t
Ġal ong
ìĦľ ë¥¼
res h
ìłķ ìĹĲ
ww w
ê¸° ìĪł
ìĻĢ ìĦľ
Ġgener al
íĶĦ ë¡ľ
Ġob serv
ê¹ Ķ
Ġg ot
ìłĦ ìŀĲ
ìĸµ ìĽĲ
Ġìĭ¤ ìĭľ
Ġb ig
ì² ¨
Ġëª¨ ìĸĳ
íĴ Ģ
ut ure
r id
Ġì£¼ ì°¨
Ġê³ §
Ġsom ething
Ġë¹ Ī
Ġd em
ëŃ Ĳ
Ġs ite
Ġm ov
ĠìļĶ êµ¬
Ġìĭľ ê³µ
Ġqu ality
ìĿ´ ë©´
one y
Ġme asure
yn am
g or
ict ion
ĠA p
b it
íı¬ ì¸ł
ê·¸ëŁ° ëį°
ëł¤ ìĦľ
Ġdes cri
)$ ,
ie ve
ëģ Ħ
ê¸° ê³ł
ìĹĦ ë§Ī
A nd
íĻ Ģ
Ġm ag
Ġt imes
id ual
ys is
D is
Y ou
at ter
ìĻ ľ
EN T
ide o
ëĤ´ ëĬĶ
r u
Ġê¼ ¬
íķľ ëĭ¤ëĬĶ
in clude
Ġì´ ¬ìĺģ
ĠìĦł ìĥĿ
pon se
Ġì «
ë Į
ë¡ ±
sq rt
capt ion
ĠìĿ´ ë²¤íĬ¸
Ġë¶Ģ ëĵľ
ĠìĻĦ ìĦ±
Ġë³´ íĺ¸
ëĵľ ë¦´
ĠëıĦ ìĽĢìĿ´
C C
ãħ ĩ
in fo
ëľ ¨
¾ Į
Ġse ver
Ġcl os
Ġê±° ëŀĺ
Ġìĭľ íĸī
Ġd at
ĠìĹ ¼
ĠíĶ¼ íķ´
Ġìļ°ë¦¬ ëĬĶ
ĠìĤ¼ ìĦ±
U S
Ġj ob
ìĺĢ ìĬµëĭĪëĭ¤
um ents
ëĭµ ë³Ģ
ĠìķĬëĬĶ ëĭ¤
ì½ ©
Ġì¢ĭìķĦ ìļĶ
ê·¸ ëŁ¼
Ġl ot
l ing
Ġì£ Ħ
mer ic
ĠëĤĺ ë¥¼
Ġen g
ain t
Ġc he
ĠëĶ° ë¡ľ
ìĤ Ń
Ġcomp on
L oc
Ġback ground
ĠíĻķ ìĭ¤
Ġm ove
Ġal ready
G amma
b ook
Ġíĺķ íĥľ
ëĲ Ĳ
Ġê±´ ë¬¼
Ġc lear
---------------- ----------------
im ate
Ġì» ´
="../../ ../../
b ase
ĠìŀĲ ëıĻì°¨
u age
Ġdet erm
d own
Ġwe bs
Ġcor respon
Ġë§Ľ ìĿ´
ê°ľ ë°ľ
Ġn il
Ġë¬´ ìĬ¨
Ġê²¨ ìļ¸
T able
roll er
> &
ib ility
ëĵ± íķĻêµĲ
Ġdisc uss
e ps
ĠíĮĲ ëĭ¨
Ġë§ĪìĿĮ ìĹĲ
ĠíĿ ĺ
g t
ĠëĮĢ íķĻ
Ġre port
ì§Ģ ìķĬ
Ġc over
; &
Ġme an
Ġrequ ired
Ġë¨¸ ë¦¬
ìĥ ¤
Ġcom b
Ġdef ined
op er
Ġì§ĳ ìĹĲ
Ġì²Ń ìĨĮ
oc ial
íĮ ©
ëıĦ ëĬĶ
s u
Tr ans
en ame
in c
um e
ìŀĲ ë¡ľ
ì§ ĵ
Ġë¯¸ ë¦¬
H e
ĠìķĦ ëĭĪëĭ¤
ê°ľ ìĿĺ
Ġì´ ī
b ug
st art
ĠìķĪ ìĹĲ
4 7
ê·¸ ëĥ¥
ìķĺ ìĸ´ìļĶ
ou d
) '
ĠP h
O ut
ìº Ĳ
L e
ĠA d
Ġìĭľ ìŀ¥
text bf
ĠìłĦ íĺĢ
Ġne ver
gor ith
p ose
ê¼ ¬
Ġë´ Ħ
Ġu nt
ìĦ¸ ëĮĢ
ro du
ĠìĹ Ķ
Ġì°į ìĸ´
Ġ ĊĊ
Ġë¶Ħ ëĵ¤
ĠO r
Ġs ide
l t
In ter
) {
Ġ es
Ġê°Ĳ ëıħ
Ġl aw
ĠëĤĺ ë¬´
í ĩ´
us ing
ê·¸ëŁ¬ ëĤĺ
U p
ĠìĿ´ ëĬĶ
' '
Ġìµľ ëĮĢ
ãİ ¡
ĠìľĦ ìĹĲ
Ġê º¼
L og
b ed
ë³ ¶
A P
k s
r ist
Ġm essage
n on
re ate
ĠëĶ°ëĿ¼ ìĦľ
S er
n ext
ĉĉĉĉ ĉĉ
sub section
Ġì²´ íĹĺ
15 0
b m
end ed
Ġd one
19 7
ìķ ¤
ĠìĹ¬ëŁ¬ ë¶Ħ
âĻ ¡
Ġìĸ´ ì©
ĠëĶ° ë¥´ë©´
Ġc a
Ġneed s
Ġë§ĪìĿĮ ìĿĦ
ĠS c
Ġb en
Ġro om
ĠìĬ¤ ìĬ¤ë¡ľ
ìĦ Ń
Ġstud y
ĠìĹħ ì²´
Ġg ame
Ġpr act
or n
pl ace
Ġíĥ Ŀ
Ġpro m
ëĤĺ ê²Į
Ġbel ow
Ġme ans
ĠíĽĦ ê¸°
ĠìĹĨ ìĿĦ
ĠìĿ¸íĦ° ëĦ·
ëĵľ ìĭľ
ëĶ ±
R eg
ĠìĹĨ ìĹĪëĭ¤
Ġcomp let
M anager
and om
ĠìĿ¸ ìĥĿ
Ġ( $
ìĬ¤ ìĿĺ
o ption
p ing
ĠëĤ Ļ
Ġsh ort
oo se
ĠíķĻ ìĬµ
ab ly
ĠE n
ĠP r
ĠìĪ ¨
ëĤ ©
ëĸ ¡
Ġê°Ģ ì§Ħ
ĠêµŃ ìłľ
ĠëĮĢ ë¹Ħ
ì¢ Ģ
ë°Ķ ìĿ´
Ġc ou
ĠìĹħ ë¬´
Ġíķ µ
Ġa ction
íģ °
ĠìĺĪ ìģĺ
ìĹ¬ ëŁ¬
T H
Ġìĭľ ìĽĲ
ĠN o
ìĿ´ëĿ¼ ëıĦ
ë° ¤
ãħľ ãħľ
Ġíķł ìĿ¸
Ġë°© íĸ¥
Ġf our
Ġre search
ìĦ± ê³¼
ê²½ ë§¤
ìľ¼ë¡ľ ìį¨
Ġìĵ ¸
ĠìľĦ íĹĺ
Ġëĵ¤ ê³ł
ìĹ ½
ip le
íģ¬ ë¦¼
ì²ĺ ìĿĮ
Ġso ft
Ġê³Ħ ìķ½
Ġíĺ¸ íħĶ
che ck
ĠHow ever
Ġìĥģ ëĮĢ
t es
Ġê°ķ íĻĶ
Ġì° ¬
ìĺ µ
Ġê°ľ ìĦł
in it
íĸĪ ì§Ģë§Į
ĠëĤĺ ìĦľ
Ġd ue
B C
Ġs rc
ì¡° ê±´
end ing
Ġë¶Ģ ëıĻìĤ°
Ġunder stand
Col or
Ġê½ ¤
ic ro
cont ent
8 8
Ġê³³ ìĿ´
ì» ´
íķĺ ìħ¨
ĠìĻ¸ êµŃ
Ġë¹¨ ë¦¬
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
Qu ery
Ġê³µ ìĹ°
ĠìĦ ¬
ë¹Ħ ê°Ģ
Ġsim ilar
Ġd ays
Ġë¶Ģ íĥģ
Ġê¹¨ ëģĹ
) =
ĠW hen
Ġstand ard
Ġl ay
ë§Ī ìĿĦ
4 6
A p
Ġêµ¬ ê²½
ìĥģ ìĿĢ
Ġíĺ Ī
ĠìĥĿê°ģ ìĿĦ
l ight
m ethod
is tr
ĠA t
Ġd om
ë¶Ģ ìĤ°
ëĤĺ ê³ł
ê²½ ìłľ
ìľ¼ë¡ľ ëıĦ
Ġë¬ »
ìļ´ ëıĻ
> (
êµ¬ ë¥¼
ì¤ ¬
ĠB e
ê³Ħ íļį
ĠìłĦ êµŃ
Ġëĭ Ī
Ġë§¤ ìĿ¼
Ġì¡ ¸
Ġì£¼ ìļĶ
Ġ$ {\
Ġíķĺ ê²Į
Ġb ro
ìķĺ ëĬĶëį°
ĠĠĠĠĠĠĠĠ ĠĠ
Ġse ction
ĠìķĦ ë²Ħ
ë¶Ģ ë¥¼
con text
Ġ ãħĭ
ìĬ¤ íĨł
j ava
ì¶Ķ ì²ľ
ĠìĬ¤ ë§ĪíĬ¸
end er
Ġë¯¸ ëŀĺ
s ign
Ġì¶Ķ ì§Ħ
ĠíĺĦ ìĭ¤
Ġwork ing
m y
re en
ìĹ¬ ìĦľ
Ġp arent
ìĭ¬ ìĿĦ
í ľĺ
ĠìĿ´ìľł ëĬĶ
ê²ł ìĸ´ìļĶ
ë³´ ìĦ¸ìļĶ
ìĭľ ê¸°
Ġìĺģíĸ¥ ìĿĦ
is f
v are
Ġê²½ìļ° ìĹĲëĬĶ
! "
d oc
or age
ivers ity
ì§Ģ ê²Į
ĠW ith
stru ction
on se
ĠìĤ° ìĹħ
Ġse arch
Ġë§Ľ ìŀĪëĬĶ
c all
m p
ë¹ Ļ
ers ion
Ġb ody
Ġê·ľ ëª¨
âĸ ²
ìħĶ ìķ¼
ë» Ĳ
O P
Ġíķ´ ìĻ¸
Ġê·¸ëŁ° ëį°
Ġìĸ´ ìļ¸
T D
Ġìķ ¡
ĠíļĮ ìĤ¬
Ġíķĺ ëĭ¤
id es
ĠìĨĮ ìŀ¬
ann el
9 5
ê°Ģ ìĦľ
ëĿ¼ ìļ´
Ġíİ ¼
Ġâ Ĺ
U ser
ê¼ ¼
Ġstr ong
Ġë§ŀ ëĬĶ
Ġresp onse
if ier
Ġê°ģ ê°ģ
íķĺê¸° ëıĦ
-- -
īìŀ¥ íŀĪ
Ġëĭ¬ ëĿ¼
Ġv ol
ìĹĲìĦľ ìĿĺ
ë¦¬ ê¸°
vare psilon
i j
ĠìĬ µ
F il
Ġchild ren
Ġm us
ĠëĴ ·
4 2
Ġê²½ ìŁģ
ê³¼ ëĬĶ
P l
ĠS et
ìĿ´ ìħĺ
ub l
A M
ĠìĤ¬ì§Ħ ìĿĦ
âĢ ¤
Ġne ar
Ġf ocus
pos ed
ìļ° ëĬĶ
Ġle arn
ëĲĺ ìĹĪ
Ġse c
f ect
Ġê²Ģ ìĥī
Ġâ ĺ
íļĮ ê°Ģ
ĠíĿ ¥
Ġproduct s
Ġëĵ± ìŀ¥
íĸĪëĭ¤ ê³ł
Ġs che
\ !
ê°Ģ ìļĶ
Ġê°ĸ ê³ł
Ġëģ ¼
Ġ è
ìĻĢ ìĿĺ
Ġm aking
Ġëª» íķľ
a im
im ension
ìĸ´ ë¥¼
Ġass oci
^{ (
Ġê³µ ëıĻ
Ġí ĩ´
} =
in ary
Ġë° ĸìĹĲ
ë¨¹ ê³ł
ĠìĬ Ī
D O
ë§Ľ ì§ĳ
d o
ĠëĪĪ ìĹĲ
ĠìĤ¬ íķŃ
ëĭ ī
a f
ĠíĿ ¡
Ġìĺ¤ ë¥¸
ĠëĶ° ëľ»
ëĨĵ ê³ł
Ġë¬¸ìłľ ê°Ģ
ìĥģ ëĭ´
id s
ìķĦ íĮĮíĬ¸
Ġeas y
Pro perty
ëĵ¤ ìĹĲ
ear ch
r ing
Ġìķŀ ìĹĲ
íķĺ ëĭ¤ëĬĶ
p ackage
Ġë¹Ħ ìļ©
Ġm atch
ë Ģ
Ġmodel s
c ss
Ġìŀĺ ëª»
ì¼ °
Ġìĺ¤ ëŀľ
å ®
an el
ĠA meric
Ġin div
Ġout put
ìĽ ħ
ect or
Res ponse
c ul
Ġto get
ìĿ´ ëĭĪ
ëĭĺ ìĿĢ
Ġc ell
Ġê³µ ê¸ī
Ġtoget her
Ġh ist
ê±° ëŀĺ
Ġd ocument
d f
Ġvis it
ro om
j oy
ĠìĤ¬ ëĬĶ
Ġë² ½
ê²½ ê¸°
Ġìŀ Ĭ
âĢ »
Ġë¶Ħ ìķ¼
ëĮĢ íķĻêµĲ
ìĹ° íŀĪ
íĹ Į
Ġc ount
ĠThe se
Ġë²Ī ì§¸
ĠìŀĪ ìľ¼ë©´
Ġìłķ ì±ħ
}^ {\
Ġìĥ ¤
íĶ¼ ìĬ¤
Ġ\ ,
c ount
ĠìĿĺ íķ´
ìĬ¤ëŁ½ ê²Į
Ġì»¬ ëŁ¬
Ġm om
Ġunt il
íĵ¨ íĦ°
Ġëĥ ī
Ġë§Į ëĵľëĬĶ
Ġìłľ ê±°
ëĭĪ ëĭ¹
am ples
Ġê²½ìļ° ê°Ģ
Ġì Įĵ
Ġre cent
Ġì į
f alse
Ġle g
Ġë§Ī ë¬´ë¦¬
et er
C lient
ê·¸ ëłĩ
ê°Ģ ê³ł
ëª ¸
Ġì£¼ íĥĿ
g ress
C all
ĠëĮĢ ìĭł
Ġle ast
ist ic
in a
íŀĪ ëł¤
og raph
Ġpoint s
Ġsim ple
Ġb ool
Ġë°Ľ ëĬĶ
Ġì¤ĳ ìĹĲ
ĠìĹĨ ìĸ´ìĦľ
ìĿ¼ ìĹĲ
ê°Ģ ìĿĺ
Ġt ask
ìĺģ ìĥģ
ĠìĤ¬ ëĿ¼
Ġpre vious
Ġëĵ± ìĹĲ
Com m
ĠìŀĪ ëĬĶëį°ìļĶ
Ġd en
Ġterm s
Ġì£¼ ê³ł
ĠìĦł ìĪĺ
ĠS he
ëĤ´ ê³ł
Ġd ri
ĠìĿ´ ëĤł
Ġme et
Ġë³Ħ ë¡ľ
Ġì¡° ìĤ¬
includ eg
ê¸° ìĻĢ
I L
includeg raphics
ent al
======== ========
c ore
is ing
ĠB l
Ġë° ĳ
ĠT V
Ġf ac
Ġì Į
se lect
Ġìłķ ì¹ĺ
C ount
go ogle
P r
A ut
Ġsh own
ë¶Ģ ëĬĶ
Ġë ĺĳ
Ġm aterial
ĠëĪĦ êµ¬
Ġb it
ëıĦ ìĹĲ
ĠT e
Ġexpect ed
Ġs al
Ġìľ ¼
ri or
Ħ ìĥĪ
C E
ìŀĲ ë¦¬
Ġê°Ģ ìŀħ
st atic
Ġas k
Ġp ort
o ptions
Ġto ol
Ġlook ing
íĺĦ ìŀ¬
ĠìĿ¼ ëĭ¨
n s
Ġë¶Ħ ëĵ¤ìĿĢ
Ġìłľ ìĭľ
Ġto day
Ġì¢ĭ ê³ł
Ġpot ential
ìĥģ íĴĪ
ï ¸
ìĥģ íĥľ
] (
and roid
ĠìŀĪëĭ¤ ë©´
f unc
íŀ ĺ
Ġíĥ ĢìĿ´
cre en
Ġfe atures
ith ub
d b
1 20
íĬ¸ ë¡ľ
ëįĶ êµ°ìļĶ
n ow
ĠíĽ ¨
Ġl arg
ĠëŃ Ķê°Ģ
ê² Ĳ
ĠíĬ¹ ì§ķ
8 5
pro of
ëĭ Ĳ
ìķĦ ë¬´
r angle
ĠëĦĺ ìĸ´
ĠìĿ´ ìĹĲ
Ġparamet ers
ìķĦ ìķ¼
êµŃ ìĿĺ
ìĺģ íĻĶ
Ġl ength
ĠëıĦ ìĻĢ
ëĲĺ ë©´
Ġw idth
ëĭĺ ìĿĦ
ĠíĶĦ ë¦¬
Ġê´Ģ ê´ĳ
Ġíķĺ ëĭĪ
u ation
re l
ë©Ķ ëī´
, "
ain ed
Ġ !!
H E
de v
Ġf ood
ìłĦ íŀĪ
Ġof ten
w id
ĠìĿ´ìķ¼ ê¸°ë¥¼
Ġtot al
Ġk ind
Ġëĵ± ë¡Ŀ
ĠìķĦ ìī¬
R ead
Ġp aper
ëĿ¼ ìĬ¤
k m
Ġem ploy
ê° Ĵ
or th
Ġo ption
ìĿĮ ìĿ´
ìª½ ìľ¼ë¡ľ
Ġcour se
Ġì² ¨
M S
Ġpr int
Ġíĸī ëıĻ
Ġë¹ µ
Ġê³ ¡
Ġíķĺ ìĭľ
ap s
ë©Ķ ëĿ¼
Ã ©
Ġì¶ľ ë°ľ
ou th
em ph
Ġstud ents
ĠëĦ£ ê³ł
ĠëŁ ¬
cl us
Ar g
; </
Ġëª» íķĺê³ł
Ġe ither
Ġë§Ĳ ê³ł
Ġs olution
Ġsever al
p en
7 7
Ġì§ §
ï ½
ë ½
N A
right arrow
âĹ ĭ
Ġ q
Ġt reat
Ġëĵľ ëŁ¬
ãĢ ı
Ġì£¼ ë§Ĳ
íķł ìĪĺ
ëĭ Į
ëĵł ì§Ģ
íĻ Ī
Ġê³µ ê²©
er c
ip s
êµ¬ ë§¤
íķ¨ ìĿ´
N ew
ol l
Ġë°Ķ ëĭ¤
m ult
Ġëį ľ
Ġst d
Ġë³´ ìĿ¸ëĭ¤
Ġìłľ ìĻ¸
pr int
al f
Ġê² ģ
ìĹħ ìĿĦ
Ġìº ł
ä ¹
Ġë§ĪìĿĮ ìĿ´
Ġì§ĢëĤľ íķ´
we b
B ig
ch i
Ġë¹Ħ íķ´
ìķĦ ì§Ģ
Ġindiv idual
ëĴ ¤
ìĤ¬ ìĻĢ
Ġíĺ¹ ìĿĢ
ìłķ ìĿĺ
ĠíĸĪ ìĬµëĭĪëĭ¤
Ġval id
Ġperform ance
b uild
âĳ ł
Ġf un
ar ing
íĥ ĳ
ìĦľ ë¹ĦìĬ¤
ìĽĲ ìĹĲìĦľ
ĠëĤ¨ íİ¸
Ġê·¸ëŁ° ì§Ģ
ĠíķĦ ìĪĺ
ìĦ¸ ë¥¼
Ġíĭ Ģ
ë£ ©
Ġf ore
Over ride
ĠëĳĲ ê³ł
B e
Ġê¸Ī ìľµ
M od
ĠìĺĪ ìĪĺ
ew ork
Ġlim it
M ethod
old er
ĠA dd
íĶĦ íĬ¸
ìĸĳ ìĿ´
ë§Ī ìŀĲ
Ġli k
å ı
ê°Ģ ëĿ½
o pt
Ġëģ Ĭ
Ġqu ant
act ory
m ark
Ġspec ific
âĶĢâĶĢ âĶĢâĶĢ
ëĭ Ń
Ġê± ·
Ġap p
ëĵľ ë¡ľ
ĠìŀĲìĭł ìĿ´
Ġëĭ¬ ë¦¬
Ġë°ľ ìłĦ
Ġ ãħł
Ġwebs ite
N o
Ġê°ķ ì¡°
Ġë°Ķ ìĿ´
Ġorig inal
Ġa way
ê³Ħ ë¥¼
im ation
ĠëĤĺ ëĪĦ
ill s
ì¶ ¤
Ġë°Ķ ëĢ
ĠìķĬ ìĬµëĭĪëĭ¤
Ġagain st
Ġëĭ¤ ë¥´
th ers
íı ´
Ġchar acter
íĶĦ ë¦¬
Ġë¶Ī íİ¸
íĻĶ ê°Ģ
íģ Ĳ
Ġstruct ure
Ġw indow
ĠëıĻ ìĭľìĹĲ
] [
( (
Ġw hether
Ġind ust
ĠL e
act ive
aj or
o pe
Ð ¸
Ġìłķ ìĥģ
ë¶ Ļ
Ġì¢ĭ ìĬµëĭĪëĭ¤
% ,
g ithub
ge q
Ġshow s
Ġh um
íķĺ ëıĦë¡Ŀ
ĠìŀĪ ëĭµëĭĪëĭ¤
ĠThe n
S P
=" ../
Ġìĺ¤ ìłĦ
Ġì£¼ ìĿ¸
oc ol
Ġtr aining
n amespace
cent er
ê¶Į ìĿĦ
ï¸ ı
ĠìĬ¤íĥĢ ìĿ¼
W h
Ġë¸Ķ ëŀĻ
c urrent
ë ¤
íķĻ ê³¼
ê²ł ëĭ¤ëĬĶ
íĸĪ ìĿĦ
Ġìŀ ĥ
h and
A d
ĠâĢ ĺ
ĠíĻĪ íİĺìĿ´ì§Ģ
Ġê² ©
ìķĪ ìĹĲ
se mb
Ġs pect
G roup
Â·Â·Â·Â· Â·Â·Â·Â·
Ġh aving
Ġab s
Ġ ðŁ
Ġst re
Ġen ough
ë¶Ģ ê°Ģ
Ġcont act
Ġìļ° ìĦł
8 00
Ġë³´ íĨµ
Ġsat isf
ë¬¼ ë¡ł
Ġc ertain
a i
ĠëĤĺ ëĪ
on y
ĠìŀĪ ìĿĮ
ëĭĺ ëĵ¤
ìķĺ ëįĺ
o op
Th ere
Ġm ot
ìłķ ìĿĢ
ë§Į ìĿĦ
Ġan n
Build er
ëĵ¯ ìĿ´
Ġì¡° ì§ģ
ens ity
Ġl oad
ä »
Ġbu y
arg in
Ġì ³
Ġê°Ģ ìĬ´
St ream
P re
Ġ< <
ĠìĿ¼ ìĸ´ëĤĺ
ĠìĦ Ń
ent ly
Ġìľłëªħ íķľ
Ġm akes
a ff
ĠìĿ¸ ì²ľ
Ġìĭ ±
. ~\
Ġkn own
L et
ĠIn st
Ġdis play
ì°¨ ë¥¼
ĠìłĦ ìĭľ
ìĥ µ
as ing
ill ion
Ġcl ient
Ġparamet er
Ġëĵ ł
ëł Ģ
ìķĪ ìĿĦ
Ġpre d
Ġì¤ĳ ê°Ħ
Ġíĺ ľ
ast ic
i ke
ve c
ĠìĺĪ ìģľ
ĠëĿ¼ ìĿ´
E E
âĳ ¡
ë¦¬ ì¦Ī
Ġdif f
Ġíıī ê·ł
il t
ëħ ¼
ìľ¼ë¡ľ ìĦľ
íĿ ¡
Ġit em
Ġr ate
Ġìĺ¨ ëĿ¼ìĿ¸
å Ń
ì¦Ŀ ìĿĦ
Ġâ Ķ
Ġê°ĢëĬ¥ íķ©ëĭĪëĭ¤
Ġê³ł ê¸ī
F r
c ast
ãģ ®
=" #
ì» µ
íķĻ ëħĦ
íĭ ´
ê´Ģ ìĿ´
ê°Ģ ê¸°
Ġë° ĸ
ĠìĤ¬ìĿ´ ì¦Ī
?? ?
¸ ëĵľ
Ġc ard
Ġë¶Ħ ëªħ
Ġë¹Ħ ë¡¯
n ull
ë³Ħ ë¡ľ
E nd
ìĨĮ ë¦¬
av el
over line
le y
ì»¤ íĶ¼
ĠíĽ¨ ìĶ¬
Ġst ep
s up
ĠìľĦ íķĺìĹ¬
Ġ ****
Ġêµ īìŀ¥íŀĪ
le v
Ñ Ĥ
Ġl ang
6 00
Ġë³´ íĹĺ
ĠN ULL
ëĭ¨ ê³Ħ
r un
Ġm oney
rou ps
ĠìĦł ìłķ
ìķĦ ëŀĺ
Ġë³Ģ ê²½
ĠìķĦ ë§Ī
Ġind ic
Ġprof ession
e vent
var phi
] )
ĠI N
im age
ìŀ ī
Ġgo ver
l ib
Ġìļ°ë¦¬ ëĤĺëĿ¼
ĠìķĪ ìłķ
at form
Ġtr ad
ì¤Ģ ëĭ¤
4 1
Ġì£¼ ìŀ¥
íİ ľ
ëĳĲ ê³ł
ĠìłĪ ëĮĢ
Ġê°ģ ì¢ħ
Ġre ason
Ġprovid ed
Ġì§Ģ ì¼ľ
ur y
4 3
ĠìĨĮ ë¦¬
íĻľ ëıĻ
In put
e lement
Ġì¼ Ģ
ë¦ ī
om en
ìŀĲ ìĻĢ
ê²ł ëĭ¤ê³ł
. }
Ġì§Ģ ê¸ī
ìłĦ íĻĶ
Ġp ast
p age
Ġam ount
( ?)
' re
ìŀĸ ìķĦìļĶ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
is on
ê±´ ê°ķ
Ġ( )
ëĬĲ ëĥĲ
ab ase
Ġper iod
ĠìĹ ĺ
Ġbe come
ĠíĽ Ī
Ġc reat
Ġwh y
ë© ĺ
Ġf ar
Ġph ys
ĠìĽĲ íķĺëĬĶ
íķĺ ë£¨
ĠB y
ìĤ¬ ê³ł
ĠëĲĺ ì§Ģ
ĠS p
Ġreg ion
ëł¤ ë©´
6 7
Ġíĥ Ĳ
Ġë°ĺ ìĿĳ
ìĿ¼ ë³¸
Ġre view
ëŁī ìĿ´
íĿ Ĳ
x y
ê°ľ ìĿ¸
} ).
Ġâ Ļ
u ro
Ġf a
cl ient
Ġf uture
ìª½ ìĹĲ
ì¹ĺ ë£Į
r ation
ìŀĪ ê²Į
Ġë¹ł ë¥´ê²Į
Ġim plement
ĠO ur
E X
s i
5 9
Ġì£¼ ìĿĺ
ì² «
Ġn at
íķł ëķĮ
ë¶Ħ ìĿĦ
P C
Ġc lean
ëģ Ī
ON T
Ġëģ ĵ
ĠëĮĢ êµ¬
Ġìĭ¶ ëĭ¤
ĠìĻĢ ìĦľ
Ġen joy
ëĤ ¼
Ġf urther
ëĮĢ íĳľ
Ġë§ ¨
R ec
ì¹´ ëĵľ
ĠC ent
ĠìĪĺ íĸī
ìĨĮ íķľ
ĠìķĦëĭ Ĳ
k g
A G
Ġëĳĺ ëŁ¬
ateg ory
ìĹĪ ì§Ģë§Į
Ġíģ´ ë¦Ń
Ġìĺ ®
Ġìŀł ìĭľ
Ġë§ŀ ì¶°
ìĿ¼ ë°ĺ
Ġt re
ì¤ įëĭĪëĭ¤
ĠI s
Ġì½ ľ
ë¡ ¤
ëģ Ŀ
ic ense
[ \
ĠC an
Ġìŀ¥ ìĨĮ
ìŀ¥ ìľ¼ë¡ľ
ë¦Ń íĦ°
ëĵ ¬
Ġmethod s
B ar
ìŀĲ ëıĻì°¨
in ing
Ġì¤ĳ ìķĻ
Ġìĺ¤ íĶĪ
gorith m
il ities
ìłľ ëĬĶ
ìĿ¼ ëĭ¨
ìĦ± ìĹĲ
qu ery
w ise
Ġê° Ķëĭ¤
ĠìķĦëĭĪ ê³ł
St atus
ĠìĤ¬ ë¬´
Ġsystem s
ì¶ľ ì²ĺ
Ġh ouse
Ġì¶ľ ìĭľ
ust er
ĠìĪĺ ìĿµ
ìŀĲ ëĵ¤ìĿ´
ëĨ ĢìĿ´
ìĿ´ìĸ´ íĬ¸
Ġcomp lete
ëĦĪ ì§Ģ
Ġappro ach
e ction
Im age
Ġfunction s
Ġh ost
Ġwe ight
ĠìĿ¸ íħĮë¦¬ìĸ´
U til
Ġac ross
m ost
Ġf low
ìĤ° ìĿĦ
f low
D ate
ë§Į ìĿ´
Ġìłģ ê·¹
Ġsign ific
ì¥ ¬
ĠD es
Ġëĭ¤ ê°Ģ
) </
âĻ ¥
Ġê°Ģ ê²Į
Ġìĭľ ì¦Į
Ġë°ĺ ëĵľìĭľ
& \
ìĸ´ ì§Ħ
Ġì£¼ ë¯¼
Ġand roid
d raw
d ir
ë² ¼
ĠTh at
he ight
Ġì§Ģ íķĺ
ëĮĢ ëĬĶ
Ġst op
ver age
Ġìĭ¤ ìłľ
Ġìĸ µ
íļĮ ìĤ¬
pl ied
ĠìĿĺ ê²¬
ëĮĢ êµ¬
ward s
ë©´ ìĿĦ
Ġf und
Ġëĭ Ń
Ġë »
Ġap plication
ìħ Ģ
Ġì²ĺ ë¦¬
Ġë§İ ìķĦ
ìķĦ ì§ģ
S ub
ìĿ´ ì£ł
d it
ver se
f ort
Ġben ef
Ġn um
Ġcon c
Ġper fect
b utton
ìĦ± ìĿĺ
Ġp o
ic ation
ut es
Ġíķľ ëĭ¤ëĬĶ
ç Ķ
ìłľ ì£¼
ëģ Į
C ell
ĉ Ċ
ìł ¤
ĠG r
Ġw rite
Ġa ir
Ġbeg in
ĠìĤ¬ëŀĮ ëĵ¤
ê³µ ê°Ħ
Ġl ower
ĠìĹĲ ìĸ´
F I
ìĿ¼ ìĿĢ
ìĬ¤ íħĮ
Ġinv ol
in o
ì£¼ ì°¨
Ġì±Ļ ê²¨
P S
Ġëĵľ ëĿ¼ë§Ī
Ġëĸ ¡
ĠíĻķ ëĮĢ
ìļ° ê³ł
Ġì¡° ê±´
Ġmem bers
ëŀĺ ëıĦ
Ġê·¼ ì²ĺ
ĠìĹŃ ìĤ¬
aram s
ĠëĮĢ ìĥģ
Ġë¶ģ íķľ
Ġev ents
G ener
< !--
Ġíİ¸ ìķĪ
ĠG o
Ġon ce
Ġdevelop ment
un g
âĢ¦ âĢ¦
Ġì±ħ ìĿĦ
ĠE ng
}, \
ìĭł ìĿĺ
Ġcommun ity
Ġìĸ´ëł¤ ìļ´
> >
Ġl a
ëª ½
( {
Ġë§Ī ìĿĦ
ìĺ ·
ìŀĪ ê³ł
ìłģ ìĿĦ
ìĸ´ ë³´
row s
5 7
ĠD o
ë§ ĺ
æ ĸ
ì£¼ ë¥¼
Ġl abel
ĠìŀĲ ë£Į
requ est
Ġen vironment
Ġbe aut
ìĦ± ìĿĢ
ìĿ´ ìĻĢ
ir m
ëł ģ
ĠìĿ´ ê±°
Ġcl ose
19 6
ĠíĨµ íķ´ìĦľ
Ġìĸĺ ê¸°
Ġfollow s
Ġtr ack
ì£¼ ê°Ģ
Ġb oolean
Ġì±ħ ìŀĦ
or ph
olut ions
ĠC o
íķĺ ìĭľê³ł
ìĦ ¬
c y
ì§Ī ìĿĦ
Ġê·Ģ ìĹ¬
ak en
ĠL et
ë³ĳ ìĽĲ
ot ype
Ġinst all
ĠìķĮ ê²Į
Ġcomm on
íŀ Ĳ
ĠI m
c ase
Ġd er
êµ¬ ê°Ģ
ê´Ģ ìĿĦ
ë³µ ì§Ģ
Ġê³¼ ê±°
ag ram
Ġíķĺ ëĦ¤ìļĶ
íķ´ì£¼ ìĦ¸ìļĶ
Ġb order
i res
ìŀĲ ìĹĲ
ê°Ģ ë£¨
rit er
ĠíļĮ ìĽĲ
Ġap ply
ìłĲ ìĿĢ
Ġê¸° íĥĢ
bl og
íĮĲ ë§¤
Ġint rodu
B lock
g ener
P aramet
m ember
R ef
ìĿĦ ê¹Į
' (
C D
Ġprovid es
I M
ê¸¸ ëŀĺ
Ġìĺ ¥
6 8
P os
arg s
ĠM y
Ð ½
Ġcomp lex
ì¡° ê¸Ī
Ġre d
âĢ ¢
) ^
ìĬ¤ ìĹĲ
ĠëĦ¤ ìĿ´ë²Ħ
Ġcondition s
ëĭ¨ ì§Ģ
ĠëĤ¨ ìķĦ
ĠëĤ ©
Ġpro perties
t x
ìŀ¥ ëĭĺ
ìľĦìĽĲ íļĮ
Ġ é
ĠUn iversity
ra ft
ĠCh rist
ĠíĸĪ ëįĺ
5 8
ë©´ ìĹĲ
Ġ vert
ĠìĺĪ ë°©
ê´ ´
Ĭ ìĿĢ
ë ®¤
ma z
ê·¸ ë¦¼
d om
Ġperson al
ë´ Ħ
In stance
ëĥ Īëĭ¤
íķ´ ì§Ħ
ìĽ ¨
Ġê±´ ì¶ķ
;; ;
Ġìħ Ģ
Ġê·¸ ëķĮ
h line
Ġì§Ģ ëıĦ
_ -
ë¹ ¨
Ġê°ĳ ìŀĲê¸°
or ld
av or
Ġun ique
Ġëĭ¬ ëł¤
ph p
ĠìĤ¬ìļ© íķł
Ġ ...
Ġdistribut ion
Ġëĵ£ ê³ł
Ġg raph
Ġìĺ¤ íŀĪëł¤
ì§Ģ ê¸°
c irc
ìķĦ ì¹¨
Ġê°ľ ëħĲ
fr ak
Ġìĭľ ìĦ¤
Ġëĭ¨ ìĪľ
ê²Į ìŀĦ
ë´Ĳ ìķ¼
S tr
ìľ¼ ìĭł
Ń ī
ĠìŀĲ ê²©
ou ch
led ge
ĠìĤ¬ìļ© íķĺëĬĶ
Ġf it
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ug in
Ġê·¸ ëŁ¼
C K
Ġne cess
port un
Ġê²½ ë§¤
Ġìĺģ ìĥģ
H T
Ġcontin u
Ġh ot
Ġìłķë³´ ë¥¼
ch ild
Ġëª¨ìĬµ ìĿ´
ì¤ĳ ê³łì°¨
ex p
} }$
To ken
qu ence
Ġv ia
Ġê°Ģ ìĿĦ
ĠíĽĦ ë³´
Ġê´ĳ ê³ł
Ġpr ice
íķľ íİ¸
Ġcom es
Ġc ut
ê°Ħ ìĿĺ
Ġê¼ ¼
Ġì£¼ ìĦ¸ìļĶ
ĠëĲ Ĳ
ĠíķĺëĤĺ ëĭĺìĿĺ
ld ots
Ġconst ant
c ap
Ġìĩ¼ íķĳ
ĠìķĦë¦Ħ ëĭ¤ìļ´
g le
ì¹´ ìĺ¤
var i
Ġëħ Ħ
Ġanal ysis
b olds
Ġhigh er
íı ¼
Ġm ajor
ĠìłĦ ê¸°
íĶ¼ ë¶Ģ
ìĭł ìĿ´
ĠCom m
ĠL ist
U L
ìĭ ¼
ë¨¸ ë¦¬
ĠìĽĲ ëŀĺ
ef ore
ĠìĹ¬ ìľł
ë° į
h as
V E
Ġìŀ ĩ
ê³µ ìĽĲ
ì ĵ
ë§Ī ì§Ģë§ī
Ġfe ature
is k
Ĳ ëŁ¬
ul ly
Ġê°Ģ ë¥´
ì°¨ ëŁī
AT E
Ġëª» íķĺëĬĶ
med i
Ġì°¨ ì§Ģ
Ġ` `
T V
ìķĪ ìłĦ
Ġqu ick
Ġìļ°ë¦¬ ìĿĺ
ĠìĿĺ íķľ
N ull
Ġê¸° ëħĲ
ym met
ê² ¹
Ġth ing
s el
ë ±
ë¬¼ ìĿĺ
ëª¨ ëĵł
Ġc opy
ĠT est
ĠìķĬ ê²Į
fin ished
Ġìĵ ´
ĠìķĦ ë¹ł
F A
Ġëĵ± ìľ¼ë¡ľ
ser ver
Ġrel ations
ìĭł ìĿĦ
ĠëıĻ ìĿ¼
ìĿ´ ìŀĲ
Y PE
iz er
ëĵľ ëł¤
add ing
ì§Ģ ë©´
Ġê³µ ìĭĿ
bolds ymbol
ĠW hat
ìĿ´ ëĤł
ê°Ģ ì¡±
ĠìĿ´ ìłĦ
Ġí Ģ
ìŀĲ ë£Į
å ľ
ne y
ĠìĻĦ ë²½
ãĢ Ĥ
ê²ĥ ìĿĢ
ëĵľ ë¦¬ê³ł
Ġíĺķ ìĦ±
s f
ĠãĢ Į
ë¯¼ êµŃ
Ġìµľê³ł ìĿĺ
ĠìĨį ìĹĲ
Ġvar ious
o ke
ìĭľ íĹĺ
Ġdet ails
t arget
Ġâ Ĩ
Com ponent
ë² ħ
y l
Ġn ormal
ëĭ ·
Ġgover n
U E
Ġwe b
ìĤ¬ ë¡ľ
ĠëıĦ ìĽĢìĿĦ
Ġs ocial
iv en
ìŀ İ
. '
N ext
iz ing
fo ot
ìĿ´ëĿ¼ ìĦľ
ob ile
O ptions
Ġê¸Ģ ìĿĦ
w ide
~ ^^
ĠìĹŃíķł ìĿĦ
ëĭ¨ ìĿĦ
con om
ĠìŀĪìĹĪ ëįĺ
Ġìĺģ ìĹħ
Ġì§ģ ìĽĲ
ì£¼ ë¡ľ
5 6
íķľ ë²Ī
Ġíķľ ëĭ¤ê³ł
Ġo thers
ri es
ìĿ¼ ë¶ĢíĦ°
ĠìłĦ íĨµ
Ġim p
ìĶ¨ ëĬĶ
ìŀĪ ìĸ´ìĦľ
Ġtyp es
ĠëĤĺ ëıĦ
íķĺ ëĿ¼
Ġìłľ ì¡°
ĠìķĦ ëĬĶ
itt ed
Ġê³µ ìľł
ë£ ¡
g es
ëŀ ©
Ġa ch
ĠìĤ¬ëŀĮ ëĵ¤ìĿĢ
ĠM ar
ìĸ´ ì£¼
Ġle arning
G L
Ġn eg
Ġê±° ë¦¬
ĠíĽĦ ìĹĲ
ĠìĻĦ ë£Į
ê¸° ì¤Ģ
L ambda
Ġì§ Ĳ
Ġ+ =
Ġëĭ¨ ê³Ħ
p c
y les
L ine
ĠìĤ¬ëŀĮ ìĿĦ
L ay
ĠìłĦ ëĭ¬
Ġap plic
íıī ê°Ģ
? !
Ġ ;
Ġcan not
Ġwork s
dis play
ìĨĮ ìĹĲ
ìĭł ì²Ń
ìŀĲ ìĹĲê²Į
Ġu nd
ëĭ¨ ì²´
Ġsignific ant
ĠC ar
ĠìŀĪìĹĪ ëĬĶëį°
ëĮĢ íķĻ
ìŀĪ ìĸ´ìļĶ
V ER
Ġìłľ íķľ
Ġê°Ģ ê³ł
Ġì¶©ë¶Ħ íŀĪ
Ġê³ł ê¸°
ë²Ħ ìĬ¤
Ġê¾¸ ì¤Ģ
Ġ ^
ĠìľĦì¹ĺ íķľ
Ġgl obal
ank s
g ing
Ġê±´ ìĦ¤
ĠíĸĪ ì§Ģë§Į
on es
Ġn ight
ìĨĮ ê°Ģ
Ġíĥ ĳ
W hen
ê·¸ ëłĩê²Į
ì§Ģ êµ¬
Ġimpro ve
l in
d s
Ġde al
Ġstr ateg
Ñ Ģ
Ġìŀħ ìŀ¥
s ing
Ġë§Ī ì¹ĺ
ìĿ¼ ê¹Įì§Ģ
H ead
ìĿ´ ë¯¸
íĪ¬ ìŀĲ
Ġdoes n
Ġth ought
ache d
ìµľ ê·¼
Ġp ack
ë° Į
un ch
ëĤĺ ëıĦ
At tribute
b oard
Ġcol l
Ġse en
Ġc irc
ens or
ìĭľ ëĭ¤
ig ation
ìŀĪ ìĬµëĭĪëĭ¤
Ġë°Ķ ëĭ¥
ëŁ¬ ìļ´
app end
ire ction
Ġê¸Ī ìķ¡
i i
âĢ Ķ
ĠíĻķ ë³´
ìľ¼ ëĭĪê¹Į
k r
ov ed
ĠìĿ Ħ
Ġìľł ëŁ½
Ġop portun
ĠìĹ¬ê¸° ìĦľ
og n
H ow
ìĿ´ ìĿĺ
ëĤ´ ìļ©
c an
Ġê²½ ì°°
mod ule
ĠìĦ¸ ìĥģ
Ġê² ª
p arent
âĸ ł
Ġí ľĺ
) -
Ġd ate
Ġw in
F ig
Ġìĺ¤ëĬĺ ìĿĢ
B ase
ëĸ ¼
' m
ì§Ģ ìĻĢ
ë§ ¹
íķľëĭ¤ ë©´
Ġelement s
ĠìĤ¬ëŀĮ ìĿĺ
êµ¬ íķĺê³ł
Ġex act
Ġcre ated
ĠI nt
êµ¬ ì¡°
ëª ĩ
Equ al
Ġact ually
ìħĶ ëıĦ
ĠíĿ ĳ
it es
Ġp air
Ġì£¼ ë¡ľ
l angle
íĥĢ ë¯¼
Ġh om
ëĵ¤ ë¡ľ
ĠF r
re c
Ġre t
9 00
} ),
ĠO ne
ĠêµĲ íĨµ
ĠìĿ¼ ìłķ
R un
Ġíķĺ ìħ¨
id ence
ë© ¸
ëį° ìĿ´
ìľ¼ ëŁ¬
c le
Ġë¶Ħ ìĸĳ
ĠG od
Ġup date
Ġres ource
tribut es
Ġìĵ° ëĬĶ
Ġë§İ ëĭ¤
ĠìĻ Ķëĭ¤
Ġë§ĽìŀĪ ê²Į
Ġ Â
Ġse par
. \
us ed
irt ual
Ġìĭł ê¸°
Ġaddition al
n own
Ġsh are
ì§ĳ ìĹĲ
ĠìłĦ ëŀµ
ëĵľ ê°Ģ
Ġchang es
Ġìłģ ëĭ¹
ìŀĲ ë§ĪìŀĲ
ition al
ibr ary
Ġmat rix
Ġsu gg
Ġ ver
v is
ĠìķĦ ê¸°
ê²½ ìĿĦ
Ġaut om
ĠN ot
, âĢĿ
Ġìķ½ ìĨį
Ġ ess
pl ac
êµŃ ìĪĺ
Ġìĺģ ìĸĳ
Ġsugg est
ĠìŀĪ ì§Ģ
Ġë²ł ìĿ´
ud io
math frak
Ġë§İ ìķĦìĦľ
v ing
Ġìĭ¶ ìĸ´
ĠìĪĺ ìĪł
Ġcol umn
d l
Ġì¤ĳ ê³łì°¨
ìĺģ ìĸ´
B uffer
S ource
Ġr a
ì²Ń ìĨĮ
Cont ent
ĠíļĮ ë³µ
Ġadd ed
er a
app ing
ĠíĬ Ģ
Ġb ox
Ġìĵ° ê³ł
ëĨ Ģ
un finished
Ġìŀ¬ ë£Į
ĠI D
if f
z e
Ġt alk
ì§Ģ ë°©
ĠìľĦíķ´ìĦľ ëĬĶ
ĠC ont
íĺ¸ íħĶ
ìĿ į
ëĭĪ ìĬ¤
ĠìĦ ŀ
Ph i
ĠìŀĪìĹĪ ìĬµëĭĪëĭ¤
id ed
ìĭŃ ëĭĪëĭ¤
Ġd iv
T O
ĠìĨį ìĹĲìĦľ
) ]
Ġë³ ¶
Ġd ouble
ìľĦ ì¹ĺ
ë¬ µ
ĉĉĉĉ ĉĉĉĉ
Ġì²´ íģ¬
ĠíĿ¬ ë§Ŀ
sm all
Įĵ ê¸Ģ
Ġì¡° ìĦł
ĠìłĢ ëıĦ
Ġed uc
depend ent
Ġì¹ľ ìłĪ
Ġë¶Ī ëŁ¬
Ġê´ ´
ĠëĮĢ íķĺìĹ¬
ãģ Ħ
O ff
Ġìĭł ê³ł
íĮ ¬
ìĤ¬ ë¬´
ìĺĢ ëįĺ
Ġìĭľ ë¯¼
ë¶Ģ ìĿĺ
ĠR eg
ë¦¬ ëĿ¼
Ġy et
Ġw alk
êµĲ íĨµ
pl ies
å Ĳ
Ġan t
Ġíı¬ ìŀ¥
Ġëį° ìĿ´íĦ°
b ased
ì²´ ë¥¼
ë¯¸ êµŃ
ĠìłĲ ìłĲ
ìł Ŀ
Ġê°Ģ ë©´
in st
âĢ ľ
ĠìŀĲ ëŀĳ
Ġhe ight
ĠìķĬ ëĭ¤
ìĸ´ ë²Ħ
Ġë½ ĳ
app a
ìĿ´ ê±´
ìĥ ·
Ġexper im
ìłģ ìĿ´ê³ł
ìķ½ ìĿĦ
ĠìłĦ ìŀĲ
Ġcomp an
ĠíĮĮ ìķħ
Ġv ideo
head er
Ġ" ""
ĩ Į
M O
Ġneed ed
ë¶Ħ ëĵ¤
ĠìºĲ ë¦ŃíĦ°
Ġêµ ³
Ġl ater
ĠìĿ´ íķĺ
ch ange
P ar
ĠìĿ¸ ìĤ¬
Ġë¨¹ ìľ¼ë©´
Hand ler
ìĽł ëĭ¤
ë¨¹ ëĬĶ
ĠâĢ Ķ
ìłĲ ìĹĲìĦľ
Ġì§ĳ ìĹĲìĦľ
Ġì¶ľ ìĹ°
w rite
Ġbl ack
Ġc ases
r l
Ġro le
ell ing
Ġst ates
Ġë¹ł ìł¸
ì§ĳ ëĭĪëĭ¤
ìĿ¸ ê³¼
ìĿ´ ë¡ľ
Ġth ough
( -
9 8
ĠìĿ¼ ìĸ´
ĠD is
ar r
A ction
ĠëĤ´ìļ© ìĿĦ
ìĭľ ê°Ģ
Ġh y
íĬ¸ ê°Ģ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ure d
" .
ê¸° ëĬ¥
Ġê¸ Ģë¡ľ
Ġre fer
Ġl ive
Ġl and
Ġê·¸ ë¦¬ìĬ¤
Ġget ting
ëĳ Ķ
ìłĢ ëıĦ
row ser
ì§Ī ìĿ´
ê°Ī ë¹Ħ
Ġte ach
Ġì°¸ ìĦĿ
St yle
Res ource
Ġì§ ĵ
ä ½
j av
Ġp ress
Ġde g
Ġë§¤ ì¶ľ
2 50
Ġresp ons
ë°° ìĨ¡
ur b
is es
th ough
F unction
7 8
ì° ¾
Ġre comm
ê³µ ìĤ¬
Ġìŀ¡ ìķĦ
ê¼ Ń
Ġser ies
Ġìłľ ì¶ľ
ëª¨ ëĳĲ
Ġappro x
Ġm ind
im ary
Ġe mail
Ġcal cul
ìĪĺ íķľ
av es
ĠìĿ´ ìģĺ
p y
S C
ĠìĿ´ ìĽĥ
o oth
ĠëıĦ ìłĦ
Se lect
ord in
ĠQ u
ìĽĲ ìľ¼ë¡ľ
ëĤĺ ìĦľ
N av
W hat
ial og
ìĿ´ ê²Į
Ġìŀħ ê³ł
ĠíĸĪ ìĸ´ìļĶ
íĴĪ ìĿĦ
ad ata
Ġe ver
Ļ ëĭĪëĭ¤
ë¶Ħ ìĦĿ
ĠìłĲ ìĭ¬
êµ¬ ìĹŃ
Ġìĺ¬ ë¦¬
Ġë°ĺ ë³µ
un e
Ġch all
Ġassoci ated
v ider
Ġëĭ¤ ëĵ¤
ë¥¸ ëĭ¤
Ġê·¼ ëį°
Ġì°© ìļ©
ĠìĨĮê°ľ íķ´
Ġê³³ ìĹĲ
Ġë³´ ìľł
Ġê°Ĳ ìĨĮ
í Ī
x ml
ë¤ Ħ
ìĭĿ ìĿĢ
Ġìľł ë¦¬
St art
Ġl oss
Ġíķĺ ëĿ½
ëĥ ī
ëł¤ ëĬĶ
j son
ion al
ëŁī ìĿĦ
ì§Ģ íĦ¸
Ġf lo
Ġíı ´
an ch
u k
ĠìłľíĴĪ ìĿĦ
ì¤ĳ êµŃ
ìĿ´ ëıĦ
ĠìĺĪ ìĪł
ĠíħĮ ìĿ´ë¸Ķ
Ġìĸ´ ì°Į
Ġê°Ļ ìķĦ
ê³¼ ë¥¼
pect ed
íĺĦ ëĮĢ
ìľĦ ê°Ģ
Ġloc ation
ĠìĿ´ìĥģ ìĿĺ
el ine
ë¨ ¼ìłĢ
Ġs cal
abl a
Ġëĭ´ ëĭ¹
ĠìĿ¸ íķľ
d et
p tr
ĠëĿ¼ ê³ł
Ġì½Ķ ìĬ¤
op en
ì°¬ ê°Ģì§Ģ
ĠìĿ¼ ìĥģ
Ġev al
ì¦Ŀ ìĿ´
cite p
ch ar
Ġìķī ìķĦ
ìĿ¸ íĦ°
ìĿ¸ ì²ľ
íķĺëĭ¤ ê°Ģ
ìĺĢ ìĸ´ìļĶ
ëĭ¤ ìĸĳ
O per
ãħĭãħĭ ãħĭ
íķĺ ëĦ¤ìļĶ
Ġmus ic
Ġcomp et
ensure math
p ng
ëĭ¬ ëŁ¬
Ġíĸī ìĤ¬
Ġreg ular
e ed
Ġrec ord
Ġcent er
pro perty
Ġstart ed
íķ Ģ
Def ault
Ġìĸ´ ë¨¸ëĭĪ
u id
Ġgr ad
ĠO bject
Ġê³¼ íķĻ
ìŀ¥ ê³¼
T S
ĠìĿ¸ ê¸°
ëł Ľ
s g
Ġë¨ ¼
ĠíĨµ íķľ
ìĭľíĤ¤ ëĬĶ
ĠìĪĺ ìŀħ
Ġsoft ware
Ġmom ent
Ġdo ing
ĠìĿĺ ë£Į
ìĩ Ħ
am ed
Ġì¡° ìłĪ
Ġêµ ´
ë°© ìĨ¡
ĠM on
un k
Ġìĸ´ë¦° ìĿ´
5 2
Ġìµľ ì´Ī
ìħ ľ
Ġíķ´ ë³´
ìķĦ ë²Ħ
k appa
ê» ı
p o
ĠC O
Ġì ¥
l s
Ġ ensure
ìº ł
Ġë§¤ ëł¥
ach ine
ĠìĥĿ ê¸°
Ġë°Ķ ê¿
n abla
Ġb ar
ĠëĤł ìĶ¨
ìŀĲ ëĵ¤ìĿĺ
ĠëĬĲëĤ Ħ
ĠëıĦ ë¡ľ
P oint
Ġrel ated
Ġaut hor
Ġar r
íĬ¸ ëĬĶ
sub set
Ġpur ch
Ġì§Ī ë¬¸
Ġëį ĺ
ĠìĥĿ ê¸´
C heck
I I
Ġê·¸ ê°Ģ
Ġp ict
ĠìĭĿ ëĭ¹
' ll
Ġìĺ Ľ
W indow
mb ox
LA SS
Ġmed ia
b ottom
ë¶Ħ ìĿĺ
ĠëĮĢ ì²´
Ġíŀĺ ëĵł
P art
Ġe mb
ĠêµĲ ìĪĺ
Ġser ver
anc ed
ë¹Ħ ìļ©
L ink
ìĹĲê²Į ëĬĶ
Ġch oose
ëĭĺ ê»ĺ
Ġê²½ ìĺģ
text it
[ "
od ing
ì¹ ¸
ĠìŀĪìĹĪ ìĸ´ìļĶ
p ack
Ġíİ¸ ë¦¬
Ġmod ule
Ġprot ected
d at
pro p
ĠìŀĲ ê·¹
Ġê¸¸ ìĿĦ
ìŀ ĩ
F actory
âĶ ģ
Ġëĵ± ëĵ±
y nt
Ġpos itive
Ġtem per
iz es
Ġê¼¼ ê¼¼
ìĭľ ê¸¸
ë¦Ħ ìĿ´
íĮ ¡
Ġbeh av
N O
ĠìĦ± ê²©
íķĺìĺĢ ìĬµëĭĪëĭ¤
Ġì°¨ ìĿ´ê°Ģ
F l
ĠëĲĺ ìĹĪìĬµëĭĪëĭ¤
ê°Ģ ìŀ¥
ĠìĬ¤ íĨł
ëŀĢ ëĭ¤
V ersion
i qu
Ġh ours
ag ing
ë¬¸ ìłľ
Ġê±¸ ìĸ´
Ñ ģ
Ġê·¸ ëŀ¬
Ġê²ĥ ì²ĺëŁ¼
Ġh old
Ġnat ural
Ġr andom
Ġcon struct
n ers
ĠìĿ¸ ìĭĿ
ĠëĮĢ ìĥģìľ¼ë¡ľ
f ind
Ġinst ead
ab or
Ġìĥģëĭ¹ íŀĪ
Ġg e
Ġact iv
ìľł ìĿĺ
ê³¼ ìłķ
ë´ ħëĭĪëĭ¤
A ct
Ġcoun try
Ġë¶Ģ íĦ°
ê¸¸ ìĿĦ
Ġì¡° íķ©
ĠëĬ Ķ
ê·¸ ë£¹
ĠM ed
ìħ ĭ
ë¶Ī ìĸ´
p ush
Ġc ity
} );
Ġê¸° ì´Ī
ĠR eturn
Ġê²Į ìĭľ
ic ult
ch o
ëĮĢ ìĥģ
str ong
ë§¤ ìĿ¼
ound s
\ |
ìŀĲ ê³ł
Tr ue
ĠìĨĲ ìĿĦ
Ġfil es
p ol
íħĲ ì¸ł
íĬ¹ ë³Ħ
ìĤ¬ ê±´
Ġìĭľ ì¼ľ
Ġcontin ue
f irst
ĠF l
ap ter
ìĭ¬ ìĿ´
Ġë¶Ī ìķĪ
Ġì°¸ ê°Ģ
ë°ķ ìĬ¤
so ft
ot imes
ëĥĲ ê³ł
N D
um b
ìľĦ ë¡ľ
Ġë¶ĦìľĦ ê¸°
Ġ **
} )$
ëĿ¼ ë©°
' ve
Ġìŀ¬ ë°Į
Ġobtain ed
ĠĠĠĠĠĠĠĠ Ċ
Ġmult iple
Ġcorre ct
ê¸° ë³¸
ãĢ Į
Ġì§Ģ ìłģ
c i
Ġwho le
eg er
Ġìŀ¥ ìķł
Ġoff ers
ĠìĥĿ ê²¼
ĠëĿ¼ ëĬĶ
ë¬ ĺ
Ġì»´ íĵ¨íĦ°
st er
Ġë§ ģ
Ġam ong
6 9
ĠìĦ¤ ìłķ
ĠìĿ´ ê²Į
st atus
ĠP C
Ġeff ic
ĠëĨ ĢìĿ´
Ġëĥ ĦìĥĪ
Ġproble ms
Ġear ly
if ul
Ġhow ever
Ġ{ @
Ġê°ķ ëĤ¨
ĠìĥĪ ë¡ľ
ì²´ ê°Ģ
ĠìĤ¬ ìĿ´íĬ¸
oh n
ëĤĺ ìĿĺ
¼ Ī
ĠC al
ê°Ħ ëĭ¤
å Ī
ìĤ¬ìĿ´ ì¦Ī
Ġbl og
Ġíŀĺ ìĿĦ
Ġc ross
ëł ¬
ëĮĢ ìłĦ
ìĭľ ë¥¼
Ġt aking
íĸī ìĿĦ
ìŀĪ ìĸ´
ce ed
íķľ ëį°
$ {
ê²ł ì§Ģ
Ġbr ing
Ġë¶Ī êµ¬íķĺê³ł
ìĭľ ìĺ¤
ĠIn tern
out e
Ġë©ĭ ì§Ħ
ìĸ´ ë¡ľ
O ne
ìŀĲ ìĹ°
Ġì¤ĳìĭ¬ ìľ¼ë¡ľ
Ġdown load
