{
  "additional_special_tokens": [
    "<|endoftext|>",
    "<|pad|>",
    "<|unk|>",
    "<|sep|>",
    "<|mask|>",
    "<|cls|>",
    "<|image|>",
    "<|audio|>",
    "<|user|>",
    "<|system|>",
    "<|assistant|>",
    "<|extra_id_0|>",
    "<|extra_id_1|>",
    "<|extra_id_2|>",
    "<|extra_id_3|>",
    "<|extra_id_4|>",
    "<|extra_id_5|>",
    "<|extra_id_6|>",
    "<|extra_id_7|>",
    "<|extra_id_8|>",
    "<|extra_id_9|>",
    "<|extra_id_10|>",
    "<|extra_id_13|>",
    "<|im_start|>",
    "<|im_sep|>",
    "<|im_end|>",
    "<|resident_reg|>",
    "<|foreigner_reg|>",
    "<|business_reg|>",
    "<|credit_card|>",
    "<|passport|>",
    "<|driver_license|>",
    "<|telephone|>",
    "<|health_insurance|>",
    "<|bank_account|>"
  ],
  "bos_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "cls_token": {
    "content": "<|cls|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "mask_token": {
    "content": "<|mask|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|pad|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "sep_token": {
    "content": "<|sep|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "unk_token": {
    "content": "<|unk|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
